[{Buenas, soy Cristian. Intenta guardarme el sitio de al lado. Puede que llegue algo tarde y los sitios vuelan, No quiero ir a última fila, Llegaste al final, o tuviste que esperar al siguiente?, XD, Siempre así, Dime, Sí, Hacerlo y luego se corrigen en clase, Hacerlos ara aprender, Lo que no tengo claro es cuando se entrega, Si antes o el lunes mismo, Corregir en principio y hacer más ejercicios, En principio, Claro, Es todo el rato lo mismo, Yo estoy harto de estos, Mandara luego el evaluable, sí, Con el día, O cualquiera de los programas que dijo, Si quieres hacerlos a papel primero, Quién fue más veloz, tú, o el tren?, Se fue?, Ou, Lo lamento, Los trenes no van muy bien tampoco, No para de retrasarse el mío y algunos fuera de servicio, Mi correo: cristianluzon@gmail.com, Por dónde andas?, Te has avanzado?, Aquí?, Anda para la estación, No te he visto, Ah, Vale, Qué estación?, Qué número de línea?, ?, La 1716 no existe creo, Qué via?, Estas más Alan te?, Adelante?, Vale, Mmm, No te encuentro, Ah, Ya veo, Yo me metí en el último y estaba parado xD, El de al lado sale en poco creo, Ya, Suerte pillando el tren, En mio sale en 5m, Ya, Se han tirado la vida para la lista, Es un despropósito eso, luego tiene que ser un coñazo pasar eso desordenado a la asistenta.  Es más fácil preguntar por la persona, Tenemos fiesta, Lo pone en el calendario, Fiesta 12 de octubre, sí, Multimedia, Agradeceré las horas de sueño que me conceden, XD, Sí, En el modelo lógico que es el texto siempre, Lo puedes dejar como atributo multivaluado tal cual, Ahí no hay problema, Funciona así, Qué tal vas con los ejercicios de base de datos?, Son parrafazos inmensos, A mi me dieron dolor de cabeza, Los acabé el vienes y hoy los repase, Y pensar que seguiremos con esto, Hacer esto por cada base de datos a crear..., Hoy si que llegaré un poco tarde, espero que no mucho, Texto claramente, La división entre 0 no se puede, Tienes que hacer una condición, lo pone en el ejercicio, Ese calculo hace que Pete sin remedio, If (divisor ==0)        No haces la operación  Else        Hace la operación, Si no se puede, no la haces y imprimes el mensaje de que que no se puede, Este finde hay que ponerse a full con la web, Okey, Habrá que hablar y preparar las cosas, Para organizarnos y eso, Nos ponemos a ello? Dime la id para que the agregue, Voy, No me tira, Mmm, #6257, Prueba tú, Ahora, Ya está, Que puse un espacio entre tu nombre y la almohadilla, Multimedia, Me ha dejado muy loco al verlo, Las armaduras son 30mb, 300mb*, Hay menos armaduras que ropa, Has hecho lo de las arquitectas de sistemas?  Me salen bastantes, pero no se cuales son las 3 principales.  He encontrado la de Von Newman y la de Havard. Pero ni idea de la tercera importante, Vale, gracias, Tengo esas 2 hechas, Solo lo que pone, Describir, arquitectura, ventajas, desventajas y equipos que lo usen, Yo he explicado estas 2 y ya, Extendiendo un poco masla de Harvard porque existen modificaciones actuales por su velocidad, Yo he puesto imágenes de su arquitectura, Hay que buscar las importantes y más relevantes, Sergi solo ha explicado la de Harvard y sus modificaciones, Qué tal el día movidito?, No me extraña, En clase no hemos dado mucho. A empezado a explicar los métodos y nos ha mostrado unos cuentos métodos de la string y eso, Denegado, Ni de coña. Y creo que suspendemos, Te has fumado algo, o es por el cansancio?, Bueno, Pensemos una idea digna de algo que nos podamos sentir orgullosos, No existe, XD, Bueno, habrá que pensar, Eso te iba a decir, Te pones y en 15 ya eres uno con el código, A mi me funciona, A menos que sea de mañana, Hasta pasadas las 2h o 2h y media, no proceso del todo bien, Mi cerebro no compila igual, No es broma, Lo tengo comprobado, Me di cuenta por las practicas, Mañana hablamos. Ahora a descansar, Yo estoy cansado y tú tienes que estar para el arrastre, Un poco bastante malo, no jodas, han pasado 2h, vale, mucha suerte con ello, menudo viaje más largo y pesado el tuyo, Estas por ahí?, Vale, Ya dirás, Menudo pedazo de viaje, Voy, Control + alt + suprimir y reinicia, Deberías de hacer una prueba o algo, A ver si es la gráfica o windows, Pero creo es windows, Ya que deja de funcionar sus funciones, El window + d no iba, La gráfica transmitía bien creo, ya que me salían bien las cosas, No lo sé seguro. Se tendría que mirar más en detalle, Quieres segir, o lo dejamos?  Yo estabas recolectando información para la web, Vale, Te aconsejo hacer algún diagnóstico de la grafía a ver, y vas descartando cosas, Vale. Pues seguimos mañana, Sube lo que has cambiado a Github cuando puedas, Cuando quieras, Vale, Sobre qué hora?, Vale.  Yo buscaré información para rellenar la paguina u miraré para otros estilos, Aún no se si tienen que seguro todos un tipo, o si pueden ser diferentes, Free?, Casi xD, Cómo pongo en inglés para decir: "número de teléfono (el fijo)" y "número de móvil ", Y  mobile number?, La cosa es que se diferencien, Land-line?, Vale, Muy al límite vas, Donde estas?, Es el de la vía 1, Te has ido al otro lado?, Por abajo?, Tengo los horarios, Ya na, Nos vamos, Ve a la vía 16 anda, O en la vía 1, Si viene otro, En la vía 1, viene en 2m, Por qué te has ido a la otra vía?, Tenía las puertas abiertas, para nosotros, era el de la vía 1, Ya veo, Bueno, pilla el de la vía 1, Debería llegar en breve, La próxima sigue al que tiene los horarios XD, Bueno, Hoy no llegas, Suerte, Ves tranquilo ya, Animación, o anime?, Animación o vida real? **, Otra mierda de live action no..., Va la tercera creo, Todas han sido malisimas, no tienen nada que ver con el manga y se ríen de el, Si no las continúan, sería un buen principio, O será otro fracaso. No se de donde sacan los fondos, A ver, ¿, Por?, Ah, No creo, Pero quien sabe, A lo mejor es +3 XD, Eso no es del anuncio del coche?, Multimedia, Pues eso, Fue para anunciar el coche, XDD, Recuerda descargar hoy el dead by day light, o mañana.  A saber cuando llegas mañana a casa.  Mañana no se te ocurra perder el tren, Sep, Han ampliado el lazo de entrega para el carnet para el 2 de noviembre.  Ya imagino que muchos no lo habrán subido.  Qué triste, que los dejen sin carnet, 9,5GB viene algo cargadete, y yo, sep, Al final llegaré más tarde, en 30m debería llegar s casa, La mierda del transporte me jodió. Tendré que tirar de metro, Sí, Pero aún me quedan 40m de viaje, No, En Fontana, Barcelona, Cerca de la diagonal, Aunque eso es muy largo, Pasdo de Gràcia te suena?, Paseo*, Bueno, En tren es un momento, 30m en total, En metro tardo como 1h, Y son dos transbordos, Menos mal que tengo viajes ilimitados, Hay 9 o 10 lines, Los cogines, Direcciones equivocada..., Sí, Solo fue una parada mal por suerte, Llegué a casa al fin. Voy a cenar y te aviso, Yo ya estoy, Vale, Qué tal te fue en la actividad 1 de programación?, Yo tengo un 9  -molesto-, Puedes pasarme una foto del peor ejercicio que haya hecho a tu parecer?, Quiere ver como esta evaluando, Si te parece bien, Vale, Yo dormiré en nada y me despertaré sobre las 9 para ir despertando la mente, Ya me diras, A qué hora seguimos?, Vale, Le damos ya?, ¿, Qué tardará?, Vale, Me suena a servidor, Un mini server easy to use?, Ya veo, Tiene su parte de base de datos, Dónde anda tu persona?, Multimedia, cosas de vodafone, han mandado un mensaje de que nos duplican la velocidad de bajada, it's free, mira a ver XD, ?, lo primero, por wifi no llegarás a la misma velocidad que con cable, donde vives? en una cueva?, Cuanto pagas por eso?, Ya veo, Empiezo a creer que los tirones del dead by day light eran por ti XD, No será uno de los juegos de Ark?, Ya veo, Cómo es exactamente?, Al menos el género, Conozco el nombre de diablo y, pero poco más, Yo igual, Y no tengo del todo claro el estilo, A ver qué pasa con ello, Hay un web para España y todo, Debe haber bastante gente, Como de costumbre, hay que saber coreano para jugar, Tienen una manía de hacer los pechos de las mujeres más grandes que su cabeza..., Lógica asiática para mejores armaduras en lo que defensa respecta:  Mujeres; menos ropa y más ligeras.  Hombres: no volverás a ver al personaje en tu vida y parecera una mole., Boku dake ga inai machi?, "Una ciudad sin mi", Es la misma serie, Le pusieron ese nombre raro en inglés, Tiene sentido, pero como no les gustan los nombres largos..., La vi, Me gustó mucho, fue muy entretenida, Qué tienes pensado para hoy?  Lo digo por ponernos con la web un rato, Eso cuánto dura?, 1h?, Lo ves entero, o vas pasando?, Ya veo, Por qué curso vas?, Vale, gracias, Lol?, Llevarán trabajando años, Que los dejen tranquilos, Se le va mucho a la gente, Explicate, Te refieres a tabular todo el código del tirón? ?, Ah, Prueba copiando y luego con el shift + tab, Eso quita una tabulación a todo y el tab solo lo contrario, Luego hay en algún lugar un botón para que te ordene todo el cogió de golpe, Si las copia y pegas desde el principio hasta el final de la line no se pierden, De descanso, acabo de repasar todo base de datos esta tarde, Voy, Y no estas conectado, No se cómo llegaré hoy, ni he llegado a Sants, Un poco bestia, No lo sé, Mañana dirá algo, Es muy raro, Y es demasiado que corregir en un día, Yo no me preocuparía, Vi tu ejercicio, esta bien, Y el otro era más fácil, Estará aún con ello o el campus actualiza lento, Esto no lo sé, Pero lo otro sí. Los tienes bien, así que no te preocupes, Lo de los 0 es muy extraño, seguro que está en ello o todos han copiado..., Llegaré tarde a final, en 3m llega el tren a Sants para ir a hospitalet. Y ya son más de menos 10, Defiende mi sitio, Multimedia, Really?, Peta o algo?, De qué tipo?, Probaste con otra?  Llenas 2h así que imagino que si, Vale, Suerte, Nunca he tenido un problema así, Espera, estas instalando en máquina virtual?, Estas haciéndolo real?, Yo de ti haría una simulación en virtual si nunca lo has hecho antes, Instalas 2 sistemas en una máquina, El ordena?, Windows?, Tus datos?, Vale, Pero ten cuidado con el ordena, No se cómo lo estás intentando, Qué usas de boot?, Vale, Cómo lo montas?, Usas algún programa para hacerlo boot imagino, Como Rufus, Vale, Rufus es el mejor, Portable, sencillo, Ocupa poco, XD, Puede que no te deje por la uefi, Tienen protección los de Windows, A mi me pasó, No pude instalar directamente un sistema operativo diferente en un portátil, Multimedia, Ha so, Las millones de particiones de Windows, Suerte, Ese el problema, Tienes que hacer memoria libre, Esta todo ocupado, No recomiendo hacer desde ahí, El grande es donde tienenes que hacer espacio, Ahí tienes que quitar, Pero es delicado, Podemos ponernos a las 6, Al final me he cortado el pelo antes y acabo de terminar, Okey, Cuando acabes la partida actual avisa y nos ponemos, Puso cosas creo. Y también de html y css, Pero no se qué es entregarle y qué evaluable, Y son para la semana que viene imagino, Base de datos seguro, Ya, Pues no se. Habrá que hacerlo por si acaso, Vale, Será más rápido, Cuándo quieres empezar?, Pues dilo, no hace falta que esperes, Ilu?, No lo sé, Pedo se entrega con el fecha limite?, No hay limite, Pero en el campus no pone nada, Y el ejercicio 4 no lo encuentro, Que entrega más mierda, Habrá que ponerse, Qué más se le puede hacer?, Lo pone en el correo, Imprimir pantalla o recortes, Es lo que dice, Tengo virtual box, Acabo de importar la ova, Dame tu correo anda, Ya está, Haz lo que quieras, No, Es porque tu ordena es diferente, Diferentes componentes, Prueba a tocar, es el procesador, Puede que tengas que cambiarlo, Yo he tenido que cambiar la tarjeta de red, Sinceramente, yo no se hacerlo. Pero si quieres miramos, En serio?, Lo lamento, Conseguiste algo con el problema de la maquina virtual?, Vale, No se Rick, parece falso, Me gustaría tocar (me encanta), pero mejor busca un tuto, Y?, Ves a acpi, O a la de graphics, Son los posibles candidatos, Pos el otro, Me encanta, Puede que no te lo detecte, Vea a integred periféricos, Periferal, Nop, Super IO, En la anterior, Ves a super IO, Sal, Ves a lo de windows a ver, En serio el primero no hay nada? El acpi, Es en el que debería estar, Acpi settings, Hazle foro, Foto*, Ou, No hay un botón de ajustes avanzados?, Esto es muy poco, Espera, Esto tiene que ver con el boot, Hay algo del boot que ponga VM?, Ah, esos son los avanzados, AMD es muy rata, O preferente, O prudente*, Qué quieres hacer?, Vale, Me quedan 2 ejercicios de base de datos y luego merendare. Tengo la cabeza como un bombo... Las Obras en caso son malas, Es una tarde y parte de la noche. Es un poco comedura de cabeza, Vale, diviértete y no lo petes xD, Juan me mató con la última: Mostrar para cada hospital cuántas personas tienen el dni múltiplo de 5., XDDDDDDD, X2, Vas a querer hacer el Discord?, Lol?, Espera, no es virtual?, Antes ha petado..., XD, Pues sí, Menudo requisito, Pero es Linux, no me extraña, Se maneja mucho mejor desde ahí, Ale, La que se ha liado con majaro en un momento, Mira a ver si en Windows no ha cambiado nada, XDD, La que le espera a manjaro, La interfaz de majaro es una shit, es tocarla y todo peta, XDDDDDD, Lo siento, no lo he visto. Y ahora estoy haciendo la cena, Y eso?, Tu duermes más tarde que yo, Vale, Multimedia, Quieres hacer un discord en un rato?, Has instalado las cosas de manjaro?, Hoy llego tarde fijo.  Se me olvidó exportar ma maquina de Manjaro y estoy en ello, Como el pc siga sin funcionar, me voy a cagar en todo, Puñeteras obras del demonio..., Sí, VM = virtual machine, La S será de system?, Costó dar con su paradero, XD se dejaron lo importante, "ya lo meteremos luego Pablo, tú sácalo al mercado", Yo los imagino así, Lol?, Tiene búsqueda?, Que OP esta la update, Pablo confiaba ciegamente en Joshua. Y Joshua hizo su trabajo la mar de bien., Cuál?, Sí, Usa ponto, No coma, O la lias, Has probado a hacer algo de html/css?, Vale, Demasiadas consultas?, Multimedia, Junto, O serían diferentes putos, Va, ya te queda poco, Puñetero tren, esta no llego...  Justo el mio, no hay suerte, ?, A menudas horas, Bueno, la diferencia es que hay un profe asignado, Aquí van las rotando las cosas, Bueno, depende en que casos, Solo espero que no sean martes y jueves, Nos lo pagan por lo que entiendo, no?, Ese es el intermedio?, Cuantos hay?, Entonces no hay intermedio, xD, Yo creo que puedo sacar el segundo nivel, El hablado..., Discord in English with Ilyass, Es posible, What?, Y cómo inicias manjaro?, Es el partition 2?, Vale, Creo que es porque windows no puede leer el sistema de archivos, Puede ser?, Trabajan diferente, No lo se, preguntaa Fidel, Una pregunta del html, Te acuerda de cómo hacer que cambie de css en vase al tamaño de la pantalla?, Base*, Me falta solo eso, Vale, A ver qué encuentro, gracias, Pero era en el css  o en el html?, Vale, Pero dijo de hacer 2 css diferentes, no?, Sí, Vale, ?, Es lo que te pregunté?, Niveles de certificados de inglés?, De qué tipo?, Secretismo?, Multimedia, Curioso me tienes xD, El examen es el mismo para todos los niveles?, Eso no me mola, Bueno, ya dirá el de inglés y tendréis que mirar y repasar temario, El libro por pdf, que no me maree, He tenido la tarde liada, Quieres un discord?, Tu pen a vuelto a la vida, pero no habla español, Multimedia, Multimedia, Si, pero no puedo abrirlo nada, No sabe qué es ningún archivo, Un formateo no le iría mal, Puede meter y crear cosas, Pero no me deja hacer nada con lo que hay, 13 gigas usados de archivos caput, No es tuyo?, Perfecto, pero ten cuidado con el ruido de fondo, tiene bastante, Tiene menos, Tiene demasiado tiempo mudo al principio, y el final es brusco, El mp3 tiene un final brusco, El wav no, Ya, Pero son 5s, Baja lo a 1, No?, Vale, Esta bien, Se pueden sacar bastante easy, Al menos los sonidos que no se solapan, Es básico, pero bueno, No se qué tiempo libre tendré esta tarde, tengo el día algo ocupado. Estaré por la noche.  Entre los mandados de mi madre y Aikido, me van a dejar fino, Del esquema que te pase para el Faq, me parece más vistoso el 2, así se deja margen y no está pegado, A ti qué te parece?, De css dices?  Puedo hacer el html en un plis luego y ya está. Con el contenido incluido (copy paste)., Los css hay que ponerse y repasar..., Me llevo bastante bien con Grid, tendría que mirar más flex box, Recuerda avisar lo que vas tocando y sube de tanto en tanto, No será divertido que creemos un conflicto de archivos, 😅, Perfecto, Bueno, me voy al mandado, Vale, XD, Vale, Qué retoques le has hecho?, Voy, Cutre no, sencillo XDD, Ahora voy para casa, Dime, Claro, Qué te dice?, No eres admin?, Qué quieres borrar?, Bueno, Voy en 5m y me lo enseñas, Te parece?, Milagro, A ver, Tiro ya para casa, Qué has hecho en este rato?, Vale, Es responsive?, Ha hecho el script de ma barra?, La barra*, Vale, Lol, Te ha llegado esta tarde. Cuantas páginas tiene?, Madre mía, Ahhh, Vale, Por cierto, Ya he mirado lo del cursos, Cursor*, Parece que será sencillo cambiarlo, Css viene preparado ya, La imagen de cursor digo, Ambas, La que sea, Puedes cambiar todo, Mañana a qué hora entonces?, Vale, Estas por ahi?, Bien, Has empezado ya?, Vale, Yo acabo de desayunar, Subiste lo último que hiciste, no?, Okey, Vale, Será mejo que descanses, si, Mira esto a ver qué te parece, Y no judges al verde, Multimedia, Los colores no son lo mio, Pero creo que ese estilo y estructura está bien, Si, si, Hay que pillarlo por banda, Son 5h de base de datos..., Perder clase de manera productiva es bueno, No hay por qué perder el descanso, solo clase, Multimedia, No me imagino un dinámica XDD, Madness, Muy limpia y sabes perfectamente lo que se puede picar y es interactivo, A qué te refieres exactamente?, Es malo?  Cuantas chicas nuevas tienen ya?, Paraclo?, Ah, Falta?, Esa saga es larga, Tiene que ser los 24 capítulos, Es lo que debería durar creo, O más, Si mal no conté hace tiempo, Daba para 2 temporadas, O más, Ya estoy en casa.  Cuándo nos ponemos con la web?, Vale, Pues me pogo a ello ahora, A ver, repasemos lo que hay que hacer, Tenemos que hacer los cambios con la paguina de main y la de halloween, Meter flexbox y grid como podamos en todos los csss, Habrá que hacerlo un poco más elaborado xD, pero veo que conoces bien el plan, Okey, Cuento dura?, Vale, Aprovecho y hago el cambio de las páginas, El video y eso, Lo tengo reciente, será un momento, Nada, Me dejan sin luz..., Cuando se pueda, En principio mañana, sí, Vale, He visto algunos problemas en el video, Vale, ¿, deja faq XD, un html nuevo, no quitas trabajo ya estructurado, solo queda retocarlo, mañana miraré el responsive de esa, sep, easy, ten cuidado cuidado con el css, vamos a sacar de mierda al validar lo todo..., todas, incluso la nueva, tu css es extraño para mi, XD, Supongo que simplemente programamos diferente, pero creas paginas muy grandes de css, ya, pero recuerda lo que no vale y al menos comenta, que luego pasan cosas raras, como lo de la coma aquella que nos encontramos al validad, te acuerdas?, mañana más, hay que ir cerrando cosas, no me pienso dedicar a css, es un dolor de cabeza extraño, creo que acabo antes creando la web en java, Cuándo empezamos?, Voy a sacar todos los suspiros, respiraciones y sonidos pequeños que pueda del audio que me pasaste, Saqué largos, Solo voy a pillar los pequeños, Vale, 2m, He terminado el pop-up, Me gustaría cambiar la función para que no desaparezca sin más, y se vaya con una animación de transparencia.  Pero creo que mañana, estoy muy cansado ya, Vale, Perfecto, Súbelo, y creo que ya tenemos prácticamente la web, XDD, Mi cabeza no puede más, no quiere saber nada de la web, No habías salido de eso?, XDDDD, Entiendo, Si, He estado mi tengo la web por encima, Falta la barra nav en contact, Lo terminaste ya, no?, La meto en un plis y a las 6 nos ponemos a repasar con lupa todo y retocamos lo que sea necesario, El texto de ahora es bastante simple, quizás sea mejor, sí, Has metido el body entero en un flex-box..., Ahora no se qué hacer con la barra nav, Esto está muy mal, Has metido flex, Con la propiedad column del grid, Es interesante ver que funciona, Aunque no entiendo e motivo, Esto no creí que se user así XD, No creo que de use así*, Vale, Ya se por qué no funcionaba el nav, Te faltaba una llave en lo de @media, Tengo que tocar, Tu te quemas haciendo cosa hasta que salen, Y yo voy detrás arreglando los fallitos o cosas raras (como lo de la coma), Ya, No me importa, Mientras luego se solucionen los errores, Lo del body..., Te lo meto en un div todos y como ai fuera el body?, No has tenido en cuenta el nav, y esta en Cuenca el nav ahora XDDDDD, Si lo toco, lo dejo con la tu apariencia, Clara esta, Voy, Listo, ?, Bueno, algo has aprendido, Mola, A tener cuidado, No, Con el comando para bajar poco a poco, Es lo único, Rm, Mientras no quieras ayuda con lo último. El join ese, Que no tengo ni puñetera idea de su uso xD, Hay que dar un intenso repaso, El resto lo entiendo y se usar en general, He hecho apaños para no usar el join en los ejercicios, Hasta que no pude más, Estas en tu casa, no te preocupes, El 8 y el 9 ni idea, El 10 era un paseo, 10: select Import from FACTURA order by Data desc;, asumo que es eso, ando algo perdido desde el último lunes, Sep, Tengo unos compañeros que están haciendo un tower defense con unity para móvil, A ver si me hacen un hueco, Multimedia, Hay bastante faena..., Lo de bases de datos tienen peligro, Ya podía ser después, Gracias por avisar, Puede que me reserve un rato para probarlo, Has hecho lo de programación?, Los 3 ejercicios, Mira, Multimedia, Vale, Será eso supongo, Una medida, Por?, Cuantas pulgadas tiene tu monitor?, Ya?, XD, Te he pasado lo de programación de ayer, De nada, ?, Ah, Te roba comida?, Me tengo que descargar el programa este para ver las conferencias?, Cómo ves las conferencias?, Blackboard collaborate, Carga muy lento esto, Sí, Va lenta la carga del video pero segura, No decía mucho en esta conferencia de 30m, no?, Sí, Ese micro de chino..., Lol, Vale, Sale por el final, O en qué parte?, Pallá que voy, El de lego ya lo pille, It's free, Necesito el launcher de epic. No?, Desde la web se puede, Hace unos años que no me meto en su web, y parece bastante mejor, Tiene a total acceso a todo y no tienes que poner la contra todo el rato, Y creo que ve algunas cosas más, Debería, Sí, Tendrás permisos totales, Y le puedes dar admin total a tu usuario, No?, Menuda shit, XD, Es windows, algún remedio habrá, Tiene más fallos de seguridad, Pues sí, Juegos totalmente gratis cada 15 días, Ya, Sin duda, Con un catálogo más amplio, Irán creciendo bien, Solo espero que no se les vaya de las manos y empiecen a sacar dinero de los usuarios, O se convertiría en lo de Sony y Microsoft, Que pagas online y te dan 2 juegos al mes, Espero que no, Que siga así, Y crecerán como la espuma, De toda la uf2, Puede poner algún instruction o consulta de tablas y preguntar si está bien, O qué hace, Puede poner de todo, Es una tómbola, No lo sé, Yo veré si puedo llegar bien o qué alternativas tengo, El Ave se ve afectado, Pero no se qué horarios habrá, Hay que dejar que elija el usuario, Claro, Las leerá, El programa tiene que ser capaz de ello, Pero el usuario tiene que elegir cual quiere introducir, Sí, Sin H plis, Dame un momento, Ya he petado el primer windows en la máquina virtual, No me deja ni instalar, ..., Ya está, Segunda vez que rompo Windows. Creo que esta casi, a la tercera va la vencida, Ya no se me peta con la instalación, Si no en la parte final, donde instalas el usuario, Da mucho por saco windows con sus carpetas, Sí, No lo he tocado mucho, Parece sémola al castillo, Los enemigos ya me empiezan por el 80..., Es como el laberinto que diga, Parece que tienen algo más de historia, Y han metido el nuevo personaje, XD, Lo han puesto el Último en los de arriba, Es el cazador, Esta con los de la rareza superior, Lo siento, estaba conduciendo, ahora voy a entrar a Aikido, Por eso os decía que no lo hicierais y luego lo pasarais a métodos, Piénsalo directamente desde un principio y aprenderás esa lógica, Y luego se nota, Okey, suerte, De donde sale ese int?, Qué es option?, Es para decidir si entra pies o pulgadas?, Porqué 4?, Solo hay o pies o pulgadas, Con un bool lo tienes, Por qué una conversión absurda?, Si quiere co convertí te entrarás pulgadas directamente, Entonces para qué la conversación?, El valor que saldrá cambiará, A ver, Si quieres convertí pulgadas a metro y cm, Pero pasas lo introducido a pulgadas y luego a metros y cm, Lo que saldrá no será correcto, Introduces algo y le dices lo que es, Luego conviertes a metros o cm, O al revés, Te da toda la información, Pero convertirlo no tiren sentido, El valor que saldrá de pende de cómo lo hagas será erróneo, O hará conversiones extra, No tiene*, Compruébalo y si te da bien, perfecto, Si tu lo lo entiendes y funciona, Esque tendrá que ver el código, Porque me parece que lo estás complicando más de lo debido y o puede que no te esté entendiendo, No, porque no comprendo bien lo que quieres hacer, no porqué hay tantas opciones, Si la opción es una string no, Pero bueno, sería igual de largo, Quizás haya que cambiar el cómo lo haces o adaptar lo, Si mete lo que no debe de va al catch, No peta, Es bueno para controlar, Suerte, Si me lo enseñas en clase tranquilamente te puedo ayudar mejor, Pero así tengo que imaginar mucho, Sep, controlas el error y no peta, No se cómo repercutirá en la optimizacion, Por supuesto, Pero no es solo eso, Es para cualquier programa que pueda ser tocho, Es pensar en el futuro, Aunque ese programa justo nunca sea muy grande, Pero es bueno acostumbrarse a esa manera de pensar, Yo también estoy jodido, Tengo que esperar 1h..., Ya, Estoy aquí parado hasta las 2 y pico, Qué te voy a contar a ti, que le tienes peor, Cura?, Lol, Dile que bendiga tu viaje, O que haga un milagro y llege antes en ave, Sep, Es muy dinámica, Mola, Desde luego tiene un diseño agradable y el echo de ser dinámica la remata, En principio sí, Yo me puedo conectar bien, Estoy con Lucas, justo probando, Okey, Si quieres metete, para probar on 3 personas, Ya nos ha puesto la nota de la web... La has visto?, Pues, no la veas, La a puesto hace 1h pone aquí, Tenemos un 5,5, Propongo matarlo, El del examen?, Has hecho los 10 test que hay?, Vale, Yo básicamente voy copiado las preguntas, Hay algunas que no las sé, Es copiar y pegar, No es que las haya escrito, Lleva más tiempo, pero así puedo estudiar, Ya que han cambiado la mierda de los test y no te dice las respuestas correctas, Yo no he terminado aún, Me quedan 3, Y el 3 no lo he hecho ya que no es para ahora, No, No te deja, Ves lo mismo, Esta esta mal o bien, Pero no ves ni lo que has contestado, Te lo envío, Ya... Es que es una mierda, Los 2 primeros si ves interrogantes es que no me se la respuesta seguro, Y el resto, si verás algunos números de preguntas con color, Esos son los que no me se, Hay 2 test que tienen mal preguntas, Le doy la buena y me dice que no, Y lo pone en el libro igualito, Me he encontrado 2 preguntas que yo sepa, Te debería haber llegado algo ya, No, Ya los dirán, Los irán diciendo cuando lleguen, A la vuelta empezarán a decir, Tienen que avisar son 1 semana de adelanto mínimo.  El problema será que se acumulen, que ya lo veo venir, Enviaste el CV para la formación dual?, Yo igual, Era hasta el 28, Lo mandaré hoy, Y a ver, Miro a ver, No, no la he visto, Pues le echaré un ojo a ver, Tiene buena pinta. La cocina por el título en inglés, Dónde mierda nos toca?, Me suena, Un minecraft rpg?, Lo conozco, si, Me van a odiar en la partida de lol por irme, verdad?, La comunidad es cáncer, To fast esto, se ha bajado en nada, Pero me he tenido que sacar una ingeniería para encontrar donde de inicia la partida (y luego encontrar gente...), Multimedia, La velocidad?, Vale, Yo te hablaba de hace 3 años. Así que no se, Puedo desinstalar ya esto?, Cómo lo desinstalo?, No tienen un botón?, Report al lol, 147 megas?, Esto es el lol?, What?, Si no tienen nada, Hay más de un mapa?, Esto es optimizar, Lo demás son tonterías, Lol?, Es demasiado, Qué han hecho?  Te hacer el jugo?, Juego*, Re hacer el juego? *, Ya veo, Imagino que van recortando de todos los lados, A ver lo que duran, Si mal no recuerdo, si, Sí, Es un contador de elementos, Multimedia, Ha costado un poco comprarlo, Tienes que validar con la cuneta de nvidia, Pero todo bien, Que va, Más seguridad imposible, Todo pasa por nvidia, 18€ a final con iva y demás, Yeah, A cuantos fps juegas al MHw?, Me va entre 30 50, Varía mucho, Lo tengo todo a full, Optimizacion..., Bajaré cositas, Vale, Antialising por ejemplo?, Suele consumir un montón, Y no tiene casi opciones, Vale, gracias, Vale ¡gracias, Tendré que salir para cambiar algunas cosas, Va mejor en pantalla completa o sin bordes?, Vale, Lo han solucionado, sí, Pos nada, 46-54 frames, Gano un fram por pantalla completa, Lol, A ti te te pasa?, Ya veo, 56 frame en el menú, Ole, 52 - 60 in game, me quedo así.  Voy a ver qué arma me cojo, Mando, XD, La he visto bastante esa arma, Voy a probar en la zona de entretenimiento, Ya lo imagino, Loco eres, Solo me llama la glaive y las espadas duales, No veo mucha movilidad de combos, o puede que no se hacerlos y hay más de lo que pone en el tuto, Es jodido, si, Cuesta mantenerse en el aire y controlar el combo, Imagino que un poste libre no es muy buena práctica, Vale, Dame un momento, What?, Pues sí, Suerte, a ver qué tal sale, Dijo que era para practicar no hay para entregar ni na, Y creo que dijo de hacerla en clase, Pasame los ejercicios de bases de hoy cuando puedas, Gracias, Ahora create la base de datos y me los pasaré, Es lo que te dije, Dale tiempo, No será para todas en un principio, Así que no se ni cómo identificar emos los que funcionan, Eso espero, He mirado lo del free sync y el mio no tiene nada de eso, Tiene algo llamado 3D vision de un sistema 3D de en nvidia para jugar, Pero ya esta, No aguantas mucha info. Eres como esos 8gb de ram xD, Avg era el promedio, no?, Pues ya tengo el 15, Miércoles, el 17 creo que deriva del 13. Es bastante similar, Queda el 13, suerte si lo quieres terminar, Voy, SÍ, Multimedia, Multimedia, solo queda la mitad del 13, para que muestre los nombres, pero ni idea de cómo sacrlos, sacarlos, Son jodidos, si, Has hecho el 13?, Ni idea, no?, No se supone que eres tú el que hiciste el ejercicio de ciclista y repasaste?, Este examen va a doler viendo llegué, Sep, Yo tengo que ver si repaso y aprendo en especula a usar bien los joins, Sí, En la chica que hay al en la entrada, Puedes en todos los sitios en principio, Otra es que tarden, https://www.youtube.com/watch?v=efD3nmwF-IM, Cuantas horas invertidas xD, Ya lo veo ya, Por cierto, qué tal fue el examen al final?, Ya, yo más de lo mismo, No conteste una y otras 2 a la mitad del practico, El teórico bueno, no me suelen salir bien los tipo test, Sí, Creo que encontrarás vida ahí, XD, El tren no va más lento porque no puede, Ha pasado ya lista?, Menudo día, Yo llego en 1m, Uno?, Más de uno, Y lo que lees qué?, Nop, Muchos minutos van ahí xD, En serio?, Menos ruido de fondo, Han dicho el número?, Pensé que habían caído menos, Bueno, 10 más y estaremos bien, Estoy de camino, a ver si llego, Sí?, Lo probaré al pasar el examen, Al final subí. Esta muy parado, debe de estar reposando o algo, One moment, Ya está, Hoy si que llego tarde..., Eran 270 megas de update, sep, Segundos, Mmm, Con lo que ha tardado, nos podía poner un 9, Si, mejor que el 5 ese, Habrá que conformarse, He estado viendo bastantes quejas del anthem, Especialmente en consolas, No quieras saber cómo va eso, Creo que tiene algo, En base a tu potencia o capacidad, Cambia la calidad él solo, Lo hace en consolas, Así que es posible que lo hayan puesto en pc para que vaya aún mejor, Yo tampoco note mucho cambio de calidad, Si es cierto eso, significa que aún les queda mucho que optimizar, Sí, A mi me iba algo peor, Era por el procesador, lo tengo asumido, Fue la mala compra del ordena, Y desde hace como un año ya lo sufro, The fuck?, Qué miércoles me has pasado?, Ha puesto notas ya?, Yo tengo un 8, Te entiendo, Pues claro, Va con Java, Algún lugar que me pueda ayudar a crear una serie de números?, Sabes cómo puedo conseguir una serie que sea 1 - 11 - 111 - 1111...., ?, Exacto, Es para la máscara delas narices, Estoy abierto a alternativas, Estaba mirando lo de programación que dejamos a medias, Eso no da, 1 + 11 son 12, ¡, ¿, The fuck, XD, Cómo has sacado eso?, Es para la máscara, Necesito me de x unos y ceros, Se cuántos son, pero la tengo que crear, El problema que estoy viendo es que el int no soporta tal número, La máscara en binario básicamente, 1111.1111.1100.0000, Necesito algo así para usar el and AND, Pero por lo que veo, no se si me sale más a cuenta convertir de string a int o hacerlo en int y usar elevado, En string es más fácil, Pero peta, es un número muy grande, Para no trabajar con la Sting y dejarme de conversiones, Mira, Una ip es x.x.x.x/mask, Si separa lo de después de "/", Me da el número de unos, Para eso quería la serie, Para repetirla las _n_ veces de los _unos_  necesarios y el resto dejarlo en _ceros_, Yo la capo claramente, Si, sí, Se capa a 10, 12*, Mmm, 16*, Pero ya peta con los primero 10 o así, El int es finito, tiene su límite y una cifra de 16 números no cabe, Y pum, Pero creo que el control va a ser más sencillo por String, Aunque la fórmula no falle, Luego teng que cambiarla y añada los ceros finales, Mmm, Shit, La última parte sin 4 ceros, El cero a la izquierda no vale..., Qué pasa si hace un 111 and 0?, Okey, Gracias por la serie, N es el número de veces?, Osea el *I* del for?, *i*, O en número en si?, Vale, Entiendo.  Creo que voy a rehacer el programa, Esto es un caos, Dime, Ups, Quiero ver si da al menos lo que quiero, Una pregunta, Puedes pensar un poco más o ya estás totalmente muerto?, Si ya sabes que son 10 unos y 6 ceros, No puedo sacar el número directo sin  serie?, Los ceros se sacarlos, Pero los unos..., Me refiero a buts, se, Bytes, Pero hacerlo en un entero, Como lo que sacaba la serie, Pero directo, Mira, el ejercicio da una ip, Esa ip la pasas a binario (para poder hacer la puerta AND, básicamente), Y cada... Cuarteto? (cada 4 dígitos) los separas en un array[4], Para que no pete el int, Ya que tengo que quitar los puntos, Y el int no puede con tantos dígitos, Me sigues hasta aquí?, Bien, Nos queda el juego después del /, Que es el muero de bytes que tiene la máscara en 1, Entonces, Ahí me dice el muero de bytes en 1 y el resto en 0, De la ip en decimal, tengo que sacar la máscara, Y luego decir los bytes que pertenecen a host (los 1)  y los que son para la Red local (los 0), Hasta la máscara xD, Aquí vienen curvas (el número de bytes), Pero estoy perdido, El /22, Se supone que es 1111.1111.1100.1111, Se supone que es 1111.1111.1100.0000*, Eso es 22, Cómo lo sacas?, ..., Shit, Eso se lo das tú, En casa se suele tener un 24, = 1111.1111.1111.0000, Vale, ahora, Son octetos, Estoy tonto, 11111111.11111111.11111111.00000000, Eso es el 24, Ahora sí xD, Y yo fallando esto, Vale ya esta, Dime?, Esperar, espera, Mira el 24 es el muero de unos, Ya está, El número de unos*, Okey, Yo re haré en programa y lo haré con strings, Luego lo haré con formula cundo lo tenga, Estas del Twitter me fascina cada día más, Estos*, No?, Bueno, le puedes dar algún intento en el tiempo que queda a ver, Qué habéis hecho hoy?, Mucha cosa, o lento?, Es que me he dormido, Vale, por qué miércoles van el T-pose?, XDDD, esta gente es demasiado, es la pose que se usa para  modelar personajes, no se si tiene alguna relación particular con Halo, entiendo, Ahora viene la batalla real, A ves si se mantiene, si sube, O si cae en picado, Bueno, luego le llegarán los problemas, Cuando un juego se have muy famoso y es gratis, Van los críos, Y la comunidad...  Lo que sufre Fornite, A ver cómo afrontan, Aunque el apex necesita más potencia para jugar lo bien, no?, XD, Bueno, Voy a hacer una devolución a Amazon, Que según Amazon, 20 pulgadas son 15cm, Okey..., No, no, Un collar, Estas por ahí?, Cómo se ponene los atributos en un schema?, Es con el ref?, No me acuerdo bien, Xs:attribute?, Ni de coña, Es que no de coña, Qué mierdas?, Ese nivel es extremo, No sabía que llegaba hasta ese nivel, O te aprender el nos de memoria, O es imposible, Cuando son 3..., Es que ataca anticipando el tipo, Que locura, Es la más chunga?, En velocidad no veas, Algún día le daré bien al Hollow Knight, Por ahora, voy a dormir, Te ha pasado ese en esa dificultad?, Doble pleno, se me han ido los 2 trenes en la cara hoy, Dudo que llegue bien, Pues... Creo que son para esta semana todos, Ya que luego viene el examen, Osea, Para la semana que pone, Los 2 primeros son para el viernes 1, pero los extra creo que se puede hasta el examen, Que es en marzo, Se viene ya, La primera semana, Creo que el día 5, Esque estaba programando cando lo ha comentado, Por cierto, el jueves estará chungo llegar a clase, Mirate bien los horarios, Ah, y al final se ve que lo de 1 a 3 era solo para enfermería, Ya..., No avisan bien, La conferencia no era para nosotros, Lo he visto, Lo pone en letra pequeña abajo xD, Solo enfermería, En primero es easy, El segundo... Aun lo estoy asimilando, No entiendo nada de eso, La parte imaginaria son los decimales?, He creado la clase básica y las variables, ya luego miraré o preguntaré a Fidel lo que quiere exactamente, Abajo del todo?, https://twitter.com/babePharmacist/status/1097748743716106240?s=19, Fuck, Lo han borrado parece ser, pues nada, https://www.youtube.com/watch?v=lF3DNOHN2cU, Okey, El buen tetris, No, De camino, Okey, Pos eso, Vas 1m antes que yo, Es que me daba todo el palo correr y necesitaba ir a servicio, Te lo acabo de mandar, Es mi versión, pero las fórmulas y demás son lo que explicó él de la Wikipedia y demás, Es lo que comentó al final que iba a poner. Yo lo hice, era un minuto más, Acabaremos fuerte la semana.  Gracias por la info, Qué habéis hecho en clase?  Se ha avanzado algo de sistemas?, Interfaces?, Por qué da lo interesante cuando no estoy?, Puedes usarlo, Pero a menos que tengas una variable local, será irrelevante, Estaba en Aikido, Tendría que dejar, El this lo puedes usar libremente, Otra cosa es que no haga lo que quieras, Enserio?, Tendré que probar, Nunca vi necesidad, Si no hay nombre duplicado, Pues pensé que se podría, XD, Ya queda menos de la mitad, En el examen, Básicamente es dtd y schemas, No?, Vale, Repasare los apuntes que hice la semana pasada, entonces, Preguntas mínimas: qué reglas hay en una división para que esta no se pueda realizar?, Ha cambiado las fechas, ahora son para el domingo los ejercicios de programación, Ha dejado más tiempo, Lo acabo de ver, Sí, Sí, El comprobante conforme has pagado, Genia, Genial *, Gran coordinación, Espero wit tengas el recibo, yo lo tuve que pedir, Ah, lo tienes a plazos, Entonces imagino que pide la matricula, La entrada que pagaste, O si no, no se, Ante la duda, dales todo XD, Restringir?, Lol, Qué les has hecho?, No lo parece, Casi te piden el alma, Llamarles y sales de dudas, No te pueden pedir algo así de un día para otro, Mmm, El de encima del nuestro, En la entrada te lo dicen igual, Pero es el de encima, Casi hasta donde está la entrada de la cafetería en el nuestro, a la derecha, ?, Son métodos que los puedes llamar sin crear un objeto de esa clase, Como los métodos de la lo librería Math, Public static tipo nombre(), Recuerda que estos métodos no pueden coger variables de su clase, No puede coger nada que no esté dentro suyo, Pero le pude pasas valores de entrada, como siempre, No es que sean muy diferentes tampoco, Simplemente no hace falta crear un objeto de esa clase par usarlos, solo lo llamas, Sí, Pero solo pide los métodos, No pases variables, Solo pon static en el método que se pide, No hay que cambiar nada dentro, No está haciendo lo como te lo pide, XD, Ese método tiene que recibir dos datos, Los dos a operar, No cuentes con que ese método tenga los objetos de la clase con la que lo llames, porque son estáticos, Llama a la clase por si nombre, Racional.multiplixar(racional1, racional2);, No la llames con un objeto creado, Se puede, pero no es necesario, O no tendría sentido el objeto estático, Los métodos y clases estáticas son super útiles cuando aprendes a usarlo, Pero tienen limitaciones, y tú ya las estás viendo, Te ha marcado casi todos en rojo solo por ponerlo en estático xD, No has pillado lo que tienes que hacer?, Esta es la pista, Pero acaba el ejercicio, condenao, Que te queda na, Piensa que los objetos estáticos no pueden coger nada de su clase a menos que sean estáticos también, Simplemente pasarle los as racionales a operar, No tiene más, Los dos racionales a operar, En vez de pasarle unos y el otro cogerlo de la clase, Que harías el ejercicio muy extraño, A parte de que petaria más, Simplemente pasarle al 2 racionales al método, Y ya, 2 objetos de la clase racionales y los óperas, Así ya los tiene, La cosa es que se los pases los 2 y te devuelva el resultado, Todos tendían que devolver un dato numérico, Los print van el la main, Ahí no pintan nada, Haz más métodos en la main, Así solo la lias en el método estático, Y me parece que no puedes poner prints, Por lo que vi en los errores, Último?, Cual?, Es lo que puso en la pizarra, XD, Multimedia, De nada, El limitado es lo que define si multiplicas y divides por 10,100, 1000...., Yo soy como el paquistaní de tu calle, tengo de todo, one moment, Ya te lo he pasado, De nada, Ah, Bueno, Era solo copiar y pegar, No había que resolver nada, Escribe código, aunque ni sea una imagen, https://twitter.com/3djuegos/status/1104070538497007616?s=19, Hello, qué ta el día?, No hemos avanzado, ha hecho repaso de la última clase (en 30m) y ha mandado 2 ejercicios... Largos, El ej4 y 5, Sí, Ha dejado esta semana, Pero no se hasta cuando, Yep, Es como siempre, Un puñado de ejercicios, 4h ha sido para esto prácticamente, Eso es que empiezas bien la semana, Fue muy pesado ayer?, Y llegaste a casa?, Que día más bonito, Jope, No me extraña, Ahora?, Supongo que a los aficionados les gustará, Espero que no lo pongan muy caro, Ya veo, No hay nada anunciado creo, ni idea, XD, bueno, promete bastante, ???, Lol, Multimedia, ..., 🦄, Comformate, Multimedia, Donde estas?, Yo no se cómo puedes vivir así, Llegaste tardísimo, Por cierto, the happy hope se pasó demon souls, DS1, 2 y 3 y blood borne seguidos sin recibir daño alguno, Después de un año desde que único este objetivo, y se lo paso uno o 2 días antes de la salida de sekirei, SEIKIRO*, Un grande, Es el primero en conseguirlo, Un streaming de muchas horas y sufrimiento, Por lo que he visto por Internet, el Sekiro lo está petando, Por ahora, sacarle algo malo sería que repite boses de tanto en tanto, No expecifica si son pequeños bosess o bosess tochos, pero eso, Y algo del apartado sonoro, que seguramente será como los souls y tiene bastante sonido ambiente, Básicamente*, El combate y enemigos de Sekiro es una pasada. No se cómo de variados será, pero he visto algunos y promete mucho, Me lo pillaré a un precio más razonable, 40 es lo máximo que ha bajado, Sekiro con gallinas asesinas de metro y poco, Hay criaturas muy extrañas, Probarlo, Compra segura, Le he hechado nada 30m, He hecho el principio, Al principio es sencillo, Luego se va la dificultad a la miércoles, Yo jugué con un compañero enseñando me, Y la cosa estabs difícil, Bastante bien, Muy optimizado, Las cinemáticas no son a tiempo real, Están grabadas, Hay mayor calidad... Pero se ven pixeles un tanto, Se nota que es un video, No es la primera vez que lo veo, También pasaba con el the middle earth sombras de guerra, Pero no se ve mal, Esta más cuidado, Lo que usa un montón de  cosas de los souls, Y el sonido de los perros eso igual, Un ligero cambio, pero mismo audio, Correr, saltar, atacar, Y seme hace extraño, Se me hace*, Lo que por ahora el parry me parece muy fácil, Puedes hacer parry en medio de un ataque prácticamente, Se cancela, En cierto punto, Tiene bastante elementos de estilo como el Nioh, y los souls, Así como el combate agresivo del Blood borne, Es la mejorar y combinación, con este estilo, No te esperes lanzarte al combate, Tiene bastante diálogo y historia, Y por lo que he visto, parece bastante mundo abierto, aunque algo limitado, ?, A qué te refieres?, Hice copy paste con todos, Pero con resta no te va tal cual, Solo cambia el valor, El primera valor de la variable es 0, Ese es el problema, El for tiene que empezar en 1, Y la variable que resta, le das el primer valor del array, Y lo mismo para el resto, Lo pillas?, Para que le puedas pasar la cantidad de números que quieras, Esa clase se puede re utilizar, Multimedia, ?, Un array indefinido de ese tipo de dato, Para poder pasarle los parámetros que quieras, En este caso, le puedes pasar un número ilimitado de doubles a ese método, Esto ya lo dimos hace tiempo, Solo esta en métodos, Que locura has liado, The fuck?, Really?, Esto se pone chungo..., Hijos de la gran..., Claro, son beneficios para elles..., VENDETTA, Rodarán cabezas, seguro, Es que me apuesto lo que sea a que solo en España había mayoría ya, Rip juegos..., Esto también afecta a libros, películas, series..., Todo lo que este en  Europa, Creo que me sumo al carro de la independencia, Pues ya sabes 💰, Encontré algo.  La invencibilidad al esquivar sigue presente en Sekiro, pero es extremadamente reducida en comparación a los juegos anteriores de from software.  Ya que la principal mecánica es el bloqueo y contraataque.  Digamos que te obligan (complican) a usar el contraataque (parry) para avanzar.  Y esto complica inmensamente el juego. Ya que de por si es difícil el parry, y se hace necesario para avanzar mejor, Y el juego tendrá 3 dlc, seguro que de pago y a 15€, Estáis en descanso ya?, No que recuerde, No te ha durado nada, Qué tal?, Manga. O esperar, Grande, Yo he llegado y justo al tren, ya nanai, La verdad es que no, Por cierto, a las 11 - 11:30 yo ya estoy durmiendo xD, Mañana le echaré un ojo, tengo curiosidad, Okay, Buenas noches, Echa un vistazo al Tweet de @_LeonDrummer: https://twitter.com/_LeonDrummer/status/1116775428612661250?s=08, Por qué sigues mi Artstation?, Tiene que desaparecer, lo  tengo que borrar, No plis, Estoy ocupado ahora, Te has viciado, De quemo, sí, Notre dame se quemó hace nada, Dime, Combinar()?, O el while?, Combinar(RegistroTrnas nombre)  {  getSaldo() += nombre.getMonto();  }, Terminaste ya?, La parte d?, Es la chunga, Tiene un enunciado de la leche, Me he tirado casi un par de horitas poniendo lo todo bien, Y com diversos problemas, Al final fui al metro para que me la cambiasen. Porque aquí no aparece nadie, Multimedia, Sí, sí. Ya viene el spin-off, XD, XD, Puedes avisar de que llego tarde? Perdí el tren, Y se retrasa el siguiente, Por cierto, Ya ha dicho Juan que no va a dar nada nuevo en principio, Es aprender a usar lo anterior aquí, básicamente, Creación de tablas, campos y consultas, Hoy si que llego tarde.., El tren que tenía que coger se ha averiado, y el siguiente se ha retrasado un cuarto de hora, Multimedia, Ya te lo daré mañana, Y eso?, Cómo estás?, Okay, Suerte con ello, Que descanses, Oye, Te has metido en el odoo desde casa?, Es que no puedo, Llevo aquí 30m, Y nos se qué cuenta me pide. Y en el server no me salen los usuarios creo cree, Vale, ya esta, He cambiado la pass a todos los usuarios y listado todos los usuarios, Bueno, casi parece que me hakeado a mi mismo... Más de una 1h así, A qué hora hoy?, Eso no es una hora, Okay, Esta vivo?, Good, Discord. Cuando estés avisa, No lo sé, Pone algo en el campus?, Al final de todo pone que le tenemos que avisar, As que mañana dirá, De sistemas has visto tarea?, No veo que fidel lo haya subido, Cambio el día, pero no recuerdo recuerdo en qué quedó, Creo que sí, Sí, son para el 22, El tema es sistemas, que está desaparecido, Sí, Es lo único. En fin de semana dudo que conteste, Cómo vas con los trabajos?, Hay mucho que hacer, Aunque mucho es copy paste, una vez tienes algo, Seo, Sep*, Pero también hay que hacer bases de datos y estudiar, Qué no que había que hacer al final en BBDDD?, Que quitó, Inserts, consultas o updates?, No?, Seguro?, No dijiste algo de lo último, Que Juan dijo que era mucho?, Sí, Pero digo para el ejercicio entregable en grupo, Perfecto, Cómo vas de programación?, Vale, A mi me queda el menú de modificar los campos del producto (la lógica está hecha pero hay que probar cosas, y luego usar las excepciones personalizadas que ya creee, Y luego a probar bugs y comentar, Te acuerda de donde hice Fidel lo de controlar si el decimal iba con punto o coma?, Había una cosa del formato que te permitía controlarlo, NetBeans va con coma, pero la base de datos con el punto xD, Es una contradicción en sí mismo, Expecifica, llego a casa en 5m, Para modificarla?, Quieres leer de la base de datos o del fichero?, Creo que hicimos ambos en clase, Esta en github, O solo el último?, Ha dejado el de la base de datos entonces, Okay, Ahora te lo paso, Te lo pasos por discord, Lo tenía comentado ya que sabía que haría falta, Hasta el sábado o domingo no podrás, no?, Con todo lo que hay que hacer esta semana..., Base de datos se entra el lunes a las 12, y con todos los apartados  que ha quitado será sencillo. Con un día debería bastar para acabarlo, Lo sé, no te preocupes, Yo acabo de terminar justo programación y sistemas. Y tú que tienes bastante más faena..., Ya veo, Bueno, yo ya terminé todo. Pero puede que haya algún error, Sí, esta bien, Los míos son funcionales, Pero aun hay código que no se usa, De lo que hizo Fidel XD, Ostras xD, Gracias, Lo más pronto posible mejor, Habrá que pasarse por secretaría mañana o pasado, Mañana me pasaré por secretaría a preguntar, Había descuento por pagarlo todo del tirón?, Descuentan 200€?, Voy a ver el grupo, Son 200 sí, Qué pasa con las notas de lengua?  Ya puso todo, no?, Menos lo último de odoo, Me queda hacer los constrain y las foreign key que se necesiten. Y repasar lo que pueda faltar, A ver, en principio ya está. Pero Juan pide que usemos algo de herencia, Pero tal y como esta esto... No se dónde diantres meterlo, porque no tiene sentido, Bueno, ya tengo el sql en si, con las tablas, datos complejos, domios y inserciones.  Ahora voy a probarlo, Te he pasado el diagrama   y el .psql por discord. Porque no se si con subirlo uno vale, o no, Comprime los con un zip, y pon el nombre de ambos, Recuerda entregar la práctica antes de las 23:59, Sigues vivo? No te veo por aquí, Yeah, Entonces solo debéis quedarte la priemra de programación, no?, Cómo te salió el último examen de Fidel?, Ufff, Pero funcionaba bien?, Pues no se, Sería por cómo lo hiciste, Puedes hablarlo con él mañana a ver. Te irá bien saberlo, No te sale muy factible xD, Estas tú que voy a ir yo, Yo ya el viernes acabé muerto por dentro, Ya no vuelvo hasta el curso que viene, a excepción del examen de Mos, Que la hora..., Ya, Sí, Pero la hora qué?, Nadie sabe, Puede que a las 9 o las 10, Pero esque esto es un cachondeo, Así no se puede, Por cierto, he tenido que dejar el monster hunter, Por más que lo configuro, lo pongo todo en medio y algo en bajo. Pero no va a más de 50fps, y en combate baja a 40 o menos, Lo mismo cuando hay muchos monstruos, Así que no sé, Y yo, Pero mi ordena no puede con eso en una calidad decente, Mi procesador no puede, La gráfica lo lleva mejor, Vale, lo probaré al llegar a casa, Pero ya te digo, lo baje a la mitad como máximo la mayoría, Y nada, Vale, Yo salí a las 11, Oye, El don't starve together está a 6€, Y son 2 copias, 3 y 3?, Nice, Tranqui, nos vemos para Mos, Y te seguiré prestando cuando lo necesites, no te preocupes, A menos que cambies tu dieta. No comes en clase ya xD, Y qué tal?, Mi espacio se queda muy pillado y necesito algo bueno, Ya me diras, No me gusta el ruido, XD, Pero al final te acostumbras y lo olvidas, Yo estoy muerto con el tema de mi pc, El procesador es de cuarta generación, no muy allá, Y vamos por la 9 creo, Pero cambiarlo requiere una placa nueva, Y mi ram es DDR3, te reía que cambiar a unas DDR4..., A más que no podría dejar la gráfica tan antigua, Pero entonces necesito otra fuente..., Yo necesito prácticamente todo nuevo, Si actualizo, Me entra la depre, Cierto, son los cutres de la torres, están en la Shit, La caja quería cambiarla por temas de comodidad y limpieza, Pero ahí no gastarte mucho, Necesito un trabajo, Mucha luz, eso consume demasiado, Apaga xD, Mi pc tiene los 4 años ya. A ver, Al principio si, O cuando viene alguien lo pones, Pero ya, Tiene demasiado consumo, Es como un foco, cuando apagas la luz, Exacto, Al principio piensas que las luces lo son todo, Luego ves que puede molestar y llega la factura de luz..., Yo cuando me lo monté, justo llegaba junio, Y jugaban bastante, Mi madre al ver la factura vino a mi, Que tiempos, Me fui de vacaciones un mes y bajo notablemente, Tú cuántos años piensas durar con ese pc?, Cyberpunk marcará su línea de vida, Yep, Y hasta 2020 como mínimo nada, Bueno, al volver esta tarde a casa probaré las settings que me mandes, Gracias por ello, A ver si así tira decentemente, El miércoles a las 10 es lo de MTA, por lo que dice el grupo, Por cierto, La oferta del don't starve together durará poco, le quedan 21h, Que no se te olvide, xD, Que me lo acaban de recordad a mi, Menuda suerte..., Que extraño, Muy raro, Cuanta gente había en clase?, Bastantes, Se escucha bastante xD, Espero que no acabe molestando te mucho, Ya tienes la copia en tu inventario de steam, De nada. Yo aún no he legrado ver el invierno en el juego. XD, Ya... Es flippant, Flipante*, pues sí, madre del amor hermoso, y la animación nada mal tampoco, promete, Después de algunos intentos y bajar distintas cosas en la configuración del MH World, ya ve decentemente, La mayoría está en medio, alguna cosa desactivas y así, Con tu configuración iba algo mejor que en una consola (40fps de media máximo 50), Ya han subido el test más cercano al examen de MTA en el campus, Yo no los busco, solo salen, Alguien tiene que animar la cosa, Qué te pareció el cyberpunk?, Cada vez más cerca, Muy pronto?, Puede que sufra retrasos, Qué se le va a hacer, Por cierto, aprovecha para descargar el nuevo dlc gratis para Borderlands 2, Que no será gratis por siempre, Ya, Muy Inesperado, El DLC trae bastante cosas. Armas nuevas, nuevo nivel de arma(legendarios ya no es lo más alto), ahora puede subir al nivel 80, nuevos enemigos, boses y conecta la historia con el Borderlands 3, Microsoft se la sacó, será la mejor sin duda del E3, Sep, Tiene buena pinta, Al igual que lo nuevo de from Software, Ya había pistas, Ahora está confirmado, Aunque no se ha visto nada, A ver qué nos cuentan, Sí?, Ya se hacia de rogar el ori, Cuanto tiempo?, Cuantas cosas vienen?, Ya veo, Yo por ahora tengo ya cosas que jugar, Y ahora que conseguí que el MHW me tirase bien, Más cositas que hacer, Sin la expansión?, Oh, Ahora hay uno mas tocho?, Y el más tocho en este último?, Ya has llegado allí?, Ah, Estoy en Santa también, Por dónde andas?, Abajo?, Podrían haber avisado con algo más de antelación. Yo esta mañana no podía... Pero bueno.  Cómo te fue?, Por eso, No es normal que te avisen así, Avisaron bastante tarde, Encima había que ir a Sants, Ya..., Destiny 2 pasa a ser f2p, expansiones incluidas, Menos la última, XD, Okay, Se pasa a steam por lo que veo, Mejor, Me voló la media hora, xD yo iba a merendar, Y qué quieres hacer?, Qué nivel estáa?, Estas*, Borderlands mismo, no problem, Simplemente saber el nivel para ver qué coger, Es el 20 y algo, Esta en el calendario, Mañana a por las notas, Qué vas a hacer?, Son muchas horas para ir a buscar un papel, Y si todo está bien..., Ya te las podrían enviar y solo ir so hay algo mal, No se qué miércoles acabo de ver    https://youtu.be/ZUbmmI5utBc, El campus ahora va peor, o soy yo?, Multimedia, solo cordinación, empezamos el jueves 19, Bueno, a ver si esto mejora cuando empiece el curso..., Bueno, El calendario está, Tenemos nos los viernes a última hora, Mos los viernes*, Eso de inglés qué hace ahí?, Que lo pongan al final como mos, O mejor, antes o después de mos, Repetidor de?, Si no había segundo año hasta llegar nosotros, Por cierto, yo entregue el papel antes de vacaciones para confirmar la cuenta y los pagos, Y aún no me han cobrado nada, Pero no deberían cobrar ya el año este?, Normalmente se paga antes de empezar, Aún no me han descontado los 3 mil pavos, Sí, El 19, Dicen que ellos se encargan, y luego tengo que pasarme en mi verano para que me cobren, Solo faltaría, Y, Ya*, Y yo, Así que bueno, Si estamos igual, es que será así, Bueno, Lo único que veo es que no dicen la clase..., Ya dirán, Sinónimo de calidad, (?), Dinero hay, pero no lo vemos, Y el aprendizaje?, Yo quiero a Fidel, no sabemos ni eso, Bueno, pues toca ponerse las pilas a volver, Sep, Yo no llamaría a eso horario..., Mandaron un correo para dar la bienvenida, Y no decía na, Era la bienvenida de la bienvenida, Básicamente te da el horario y lugar donde tienes que ir, El tema es que mandan todo de todos los lugares de tirón, Te puedes meter dentro, Te manda a otra web, Lo que está en azul, Es el link, Te dice mucha cosa, Lo importante es que empezamos el jueves, Eso ni idea, De habrán equivocado, Es que no es ni un horario, 3 clases mal puestas, Yaaa, XDDDD, Se lo montan fatal, en serio, Cada año se superan, Miedo me dan, Sí, Ya me dirás cuando llegue a sants, Llegando a Sants?, Ah, okay, Te espero yo xD que me equivoqué de hora a despertar y ya estoy llegando a Sants, Perdí una hora de sueño, Ya decia que había algo mal, Así no llego tarde, Llegaste ya?, Pos a subir, Por aquí?, En qué vía has venido?, Estoy donde entramos para ir al centro, Donde la tienda del barca, Al final dónde has ido?, Vamos viajando, Estoy con Oscar, No llegas?, El sitio está, Sobran muchos asientos xD, Tienes uno al lado mío, Es donde me senté ayer, Nop, La única diferencia, es que la pantalla está más cerca de ti, Funcionaba bien, El mio ni carga, Si pasó algo de verdad, sí, Yo de ti correría con él,  a ver si te dejan pasar, Corre, Tienes el modelo de cv que se dio en fol?, Necesitamos ese para hacer el cv, Yo no tengo ni siquiera la clase y fue quitada ya, Estas?, Crees que un B1 de inglés se me ajustaría?, Es un 34 - 45 sobre 120, Se llama pet... No se si tomármelo como un insulto, Pero yo al otro no se si llego, Por eso mi duda, Puedo ponerlo, Pero es probable que de manera escrita no llegue a ese nivel, Y de oral no hablamos, Lectura puedo tirar, Leñes, tendré que hacer una prueba o algo, A qué hora quieres quedar dar?, Quedar*, Para hablar, No decías de hablar esta tarde?, Por eso digo, hora, Cansado de la rutina?, Okay, Yo estoy con el hijo de mi prima, que tiene 4 días, Si hago algo hoy, es hablar contigo y mirar lo de pilar, Perdona, esta mañana estaba complicado, He tenido que abrir el pc porque ya le hacía falta una limpieza a fondo, Y ahora tengo que comprar pasta termica, que no tiene, Nop, Limpieza física, Esta tarde podré hablar de 6 a 8, En principio, Sí, luego podemos hablar, Okay, a esas horas hablamos, Ya voy, Se está encendiendo, El pc, Que se me olvidó, También me dijo que ellos me pasarían material para aprender y demás, No tenía que buscarlo todo yo, Llegas al tren?, Iría con "K" al principio, Nice, Seguramente, De unos 10m, Estarás por aquí, no?, Si no te veo aquí xD, Okay, Vale, Bueno, aquí no llega nadie igual, Siempre somos los último en que nos abran la puerta, Hay que hablar con Carmen de Mos... Sabes que en el manual no se puede buscar nada por nombre ni copiar nada?, Así es imposible moverse rápido por el manual de 100 y pico páginas, No exactamente, Puedes copiar, Pero te sale con carácter extraño, Digamos que no está bien creado el pdf, Por ello tampoco puedes buscar nada, Lo cual me jode mucho, No, no, No va, Puedes buscar, y se supone que son letras que puedes copiar, Pero como digo, esta mal creado y no corresponde a los caracteres alfanuméricos del teclado, Es muy raro, pero en definitiva, Solo se puede leer el manual, Nada más, Yo quiero que pase el manual bien, O que diga el nombre del mismo, No tiene portada para buscar el. Libro, Por cierto, lo ejercicios te los sacas en menos de 1h, yo acabo de terminarlos, Claro, Recuerdas la clase de Fidel sobre gestión de archivos?, Escribir y leer?, Pues eso, No ha dado teoría en sí, solo enseñado el documento que está colgado, Y nos ha mandado hacer los ejercicios (dado que se supone que ya tenemos las bases de esto aprendido), Okay, Que estamos en general más o menos al nivel que esperaba y podemos avanzar en la clase, Por eso, Se da por sentado que sabemos lo del curso pasado, Vale, Si tienes lo de Fidel para repasar. Deberías poder hacer rodrigó, Poder hacer todo*, De nada, Spamer, Mala persona, Multimedia, Multimedia, Multimedia, 🎃, Multimedia, Multimedia, Not even close, Más justo imposible, xD, 😂😂, Christian, Para mañana hay que hacer los 3 bloques?, Yo recuerdo que en clase nos iba a dejar, Dijo algo parecido, Y el ejercicio estará relacionado con esto nó??, Si mal no recuerdo dijo algo que será evaluable, Okey, 👍👍, Hay que hacerlo en papel o pdf??, 😅, Tren, Yep, En mi cara, Ahora a esperar 1 hora, Nope, Sigo aquí, Estoy en la estación, 17, 16, Izquierda, Noooo, Multimedia, xd, 16, Si, Bastante más adelante, Casi lo pierdo, Cogí el último, 😆, Que el siguiente salía como a 9, Jajajajajajajjaja, Yo no me la quería jugar, Pfff, Por suerte pillé este, Que grande el fidel, Pasando la hoja cuando ya ha acabado la clase, Mañana hay clase???, No jodas, Jaudhshsyhwydgdyshqhwgdye, Buqbsubdudvdyhwhww, Bqisbsjxbxuwvjwhwwhvw, Nice, Ya somos dos, Cristian, Una pregunta, Sobre el atributo "teléfono" que han preguntado por el grupo, Cada vez que tengamos un atributo multivalor lo tenemos que transformar en entidad ??, y en el diagrama?¿, 👍👍, bien, mucho texto la verdad, pero por lo demas bien, xD, xD, 😂😂, ya, 👍, El primer ejercicio se lo mandamos .java o en texto, 😆, Multimedia, Sabes cómo solucionar lo de   dividir entre 0???, allí esta mi duda, no se como hacerlo, xD, grande cristian, solucionado, Yep, Cómo lo hacemos, Discord a las 7???, Yep, Ok, Go, Eliass #5883, Perfecto, A por los 5gb, Lol, Todavía no me he puesto con el ejercicio, Cuando tenga algo te digo, Sobre von neumann y Harvard tenemos que desarrollarlos??, En el enunciado no sé si hay que desarrollar von neumann, Un poco confuso, O directamente hay que centrarse en Harvard u otras, Hay bastantes arquitecturas, Lo que no sé es si alguna de ellas están a la altura de estas dos, Llevo despierto desde las 5:30, Estoy medio muerto, 👍👍, Hacemos una página porno, Yo lo veo, 😂, Jajajaajaja, Sería gracioso, Entra dentro de las reglas, Las dos, Me lo comentó un amigo, Y me pareció gracioso, 😂😂, Eheheheheehehehehe, Blasfemo.com, Xd, Mañana discord, La putada es que estos últimos días no he tocado mucho codigo, Intentaré repasar por la tarde cuando llegue, xd, 👍👍, Yep, No siento las piernas, Creo que eso es malo, He perdido el tren, 😆, Si, Lo tenía a las 10, Ya, Pillé otro las 2, 1**, Todavía no he llegado a casa, En 20 min estoy, Yep, Va, Métete, Multimedia, Perfecto, Mejor lo dejamos para mañana, Esta reiniciando, La imagen se parte por la mitad, Me suele pasar cuando se apaga la pantalla, Ok, Estaba cargado por eso, Seguimos mañana mejor, Ok, 👍👍, Okey, Yo luego me meto, Que mi hermano le está metiendo al fortnite, 7:30, Más o menos, 👍👍, https://www.humblebundle.com/software/degica-software?partner=fukuy, Nah, Phone number, Landline phone, No sé si este último va junto, O separado, Nah, Como lo he puesto yo, 15 sec más tarde y lo perdía, Seguro?, En el otro, Joder, Seguí a Roger y matias, ......, Yep, Me bajo del otro particular subirme al de la uno, Y se va el otro, Jodeer, Na, Van a sacar peli de Shingeki no Kyojin, Real, A ver lo que hacen, Con tal de que cojan a un buen protagonista, Yo estoy cagando por los titanes, Cagado*, No quiero que sea una peli family friendy, Para crios, Multimedia, Ni puta idea, He buscado GIFs y fue el primero que me salio, El protagonista japonés, Y los demás americanos, Lo conpro, Con tal de que se la saquen con levi, Yo la veo, Lol, 😂😂😂😂, Mañana van a ser risas, Ya veras, Multimedia, Tengo ganas de probarlo, A ver si mañana le damos, Multimedia, Yo con el catalán, 👍👍, Vieja confiable, Lol, Estabas en girona o algo, 😂, Ni idea de ese lugar, 😆, Más allá de la rambla no se nada más, Me suena el nombre, No se cuantas líneas de metro habra, Pero viendo la ciudad, Hay que sacarse un ingenieria para entenderlo, Perfecto, No toco el metro ni con un palo, Pedalea, Tu puedes, 👍, Voy al baño, No me he fijado, Voy a vee, Ver, Otro 6,5, ...., Te las paso mañana, Voyy, 7?, Esta mi hermano pequeño jugando, 40 min o así, Busca xamp por Google, Me ha dicho que lo usara, Uhh, Estan regalando destiny 2 por battle.net, Wtf, Lol, Joder, Espera, Yo tmb tengo vodafone, Multimedia, Aquí algo falla, Yo también tengo fibra, Voy a ver por cable, Multimedia, xd, No se, Supuestamente tenemos fibra, Eso me dijo mi padre cuando llegue aquí, Te suena "Lost ark"??, Nope, La gente dice que puede ser el siguiente diablo 4, Un diablo 2.0, Nunca he jugado a ninguno del estilo, Pero promete, Lo poco que he visto me ha gustado, Espero que lo saquen en Europa, Watch TwoSixNine with me on Twitch! http://www.twitch.tv/twosixnine?sr=a, 😂😂, Tanto cuesta que sean normales, Boku dake se llama, No, Erased se llama en inglés, Aaaa, Iba a ver la siguiente clase de html y css, 2 horas, 😅, Entero, Si paso me pierdo, Esta bastante bien, Por si quieres echarle un vistazo, Lecture 2, I’m taking a course on edX! Check it out:  https://www.edx.org/course/cs50s-web-programming-with-python-and-javascript, Por si quieres echarle un vistazo, Multimedia, +40000 firmas para la cancelación del nuevo diablo, La gente esta muy mal, Una cosa es estar en desacuerdo y otra es em odio, No lo entiendo, Cristian, Cómo se copiaba sin perder tabulaciones??, tengo los metodos abajo, y me da pereza volver a escribir, no se como hacer el copy paste, sin perder las tabulaciones, si, para copiar y pegar, y si quiero subir el codigo, no quiero quitar las tabulaciones, tan solo quiero subir sin perderlas, uhm, voy a probarlo, estas haciendo algo ahora?¿, necesito tu ayuda, problemas pasando de metodo a todo en el public, discord?¿, Fidel esta poniendo ceros?, Que esta pasando por el grupo??, 😂, La limpieza ha llegado antes de lo previsto, Estoy un poco cagado, No me ha mandado nada, Tu crees?, 👍, Llevo como dos horas intentando instalar el manjaro, Yep, Problemas con la iso, Cada vez que la  inicio da error, error unknown filesystem grub rescue, Voy a probar algo que he encontrado, A ver que tal, Yo con windows nunca, Es la primera vez que instala algo de arch, No, La máquina no la toco ni con un palo, Yep, He particionado el disco, No pierdo nada por probar, Nah tranquilo, Si no funciona ahora, Lo dejo por hoy, Si, Bios y lo corro desde usb, Y es allí cuando se peta, A qué te refieres??, Yep, 😆, Multimedia, Multimedia, Hago puta magia, Lo corrí en dd en vez de iso, Multimedia, Rip, 😂, Estoy jodido, A ver como particiono el disco particionado, Yep, Lo hare luego, Menor, Mejor*, Okey, Yo estoy aquí con el destiny, Hay que entregar algo de bases?, Uhm, Ok, Son 4 de html y css(usando flex boxes) y 2 ejercicios de bases de datos, Pero no pone fecha de entrega, En lo de bases, Hacemos los tres de flexbox por la tarde, ??, Yep, Te estaba esperando, Estaba escuchando el podcast de ilu, Métete discord, Exactamente que hay que mandarle sobre  lo de bases ??, Me entero ahora que es para mañana, Perfecto, No tengo ni idea, Es que no se, Mando un email hace 5 dias, Que pone como fecha límite mañana a las 9:15, No se que hacer, ...., Digamos que se hace, Qué le mandamos?, Como se hacen los pantallazos esos, Lol, Tienes instalado todo?, Yo creo que no, Mi ova no va, Rip, ilyasreque@gmail.com, No pasa nada si toco tu ova?, Seguro?, Multimedia, A tí también te da este error?, Tampoco me funcionaba con la mía, Discord?, Nada olvidalo, Por lo que leído, Tengo que meterme en la bios y cambiar cosas, Cosa que no voy a hacer, Le mandaré un correo, Si, ...., Pues nada, Todos los error los tengo yo, Lo voy a ver ahora, Acabo de llegar a casa, Alguna idea de cómo activarlo??, Multimedia, No se, Ya he buscado, La mayoría tienen procesador intel, Con amd cambia un poco, Acpi nada, Solo hay algo de energía, Multimedia, En graphics no hay nada, ......, Multimedia, ?, Multimedia, Multimedia, Voy a mandarle un correo, Hablaré con el mañana, Que significa?, No me suena, Multimedia, No hay nada, Dudo mucho que sea lo de led, La bios de intel es mucho mas claro, Clara*, Multimedia, Estoy en avanzados, Un discord luego??, Nada en especial, Yo me quitaré de encima todo lo de bases de datos cuando lo solucione, Voy a jugar hoy con manjaro a ver que tal, Ya, Xd, Lol, Jajajaajjaaj, He petado el sistema operativo, Ha sido meterme  en la configuración de los paneles, Y todo se desmadró, Instalo discord en manjaro y me conecto, 😁, Nope, A ver como va, Si, Tuve que reiniciar, 😅, Jajajajaa, Espero que nos enseñe como hacer un backup cada x tiempo mañana, Por que viendo como esta yendo la cosa igual lo necesito, Por lo poco que he visto, Si quieres tocar algo lo más mínimo, Tienes que usar el terminal, Yep, Multimedia, Esto es tan solo el principio, Cuando sepa como hacer un backup sin tener miedo a perder cosas, Lo voy a explorar, Yep, Yep, Multimedia, Multimedia, 😆, Discord?, Yo estoy en la cama ya, 😆, No lo se ni yo, Veré una serie, Mr robot me llama, Ok, Multimedia, Creo que esto, Mis dieces para el que hizo la interfaz, Bios actualizada y virtualización solucionada, Easy, Xd, Me acabo de dar cuenta de que había una barra de búsqueda, 😆, Podría haber puesto VM, Y ya está, Yep, Si, En general la interfaz la bios de msi esta muy currada, Graficas, Estadísticas, xd, Multimedia, Una cosa, El apartado g sería algo así: float ' descuento' (3,2), ?, 👍👍, Vale, No tuve tiempo, Mañana le meteré caña, Vas a hacer algo luego, Me estoy liando con esto, Me va explotar la cabeza, 😆, 😂, Yep, Definitivamente necesito tu ayuda, Multimedia, En el a hay que poner todo en un comando o separado?, .,., La mitad del primero y el ejercicios 4, Estoy jodido, Vamos a tener inglés, Hehehehhehehe, Me han alegrado el dia, Mi tu gmail, 😂, Mas vale tarde que nunca, El examen este me va a dar la vida, Sería un puntaza, Puntazo*, Son dos años, Mas que de sobra para sacarme el c1, No creo, 4 niveles, El primero es de primaria, Ni idea, Lo practicas conmigo si quieres, Metele caña al ingles cristian, Te va salvar el culo en un futuro, Cristian, Sabes por qué la bios no me detecta la segunda partición???, No me aparece manjaro, No me la detecta la bios, Me metí antes en windows oara asegurarme y todavía seguía la partición, Multimedia, Allí me aparecía, Si, Del disco c, Todavía sigue, Pero no me lo detecta, Uhm, Que puedo hacer entonces?, 😆, Manjaro, La que estas liando, @media, Si mal no recuerdo, Css, Multimedia, Estas haciendo la tarea?, Todavía no me he puesto con ella, No sabría que decirte en estos momentos, Multimedia, sobre que?¿, xD, eso es una tabla con los puntos que hay que sacar en el examen, para que te den el correspondiente nivel, tengo pensado en empezar un proyecto de aquí a un mes, ya te comentare, que va, si, dependiendo de la nota que saques, te dan un nivel, Si, Estoy cansado la verdad, Wtf, Funciona?, 😆, De donde ha salido toda esa mierda, Multimedia, Multimedia, se nota al final creo, primero era wav, este ultimo .mp3, Uhm, Sin cascos se escucha diferente, Lo del tiempo al principio, Creo que esta bien, Mejor así a que salte de golpe, Ya, Si eso mañana, Yep, De lo poco que he visto con audacity, Puede separar todo, Lo relacionado con estéreo, Izquierda, Derecha, Y mono, 👍, Bien, Será lo último que toque, Si, Si, Déjamelo a mí, Dudo mucho que me conecte hasta que tenga cosas echas, Si eso como mínimo mañnana por la tarde, Yep, Multimedia, Ya lo he solucionado, 😆, Multimedia, Discord?, Multimedia, La validación de la pág oficial de senuas blade, 😆, Una cosa, Sabes como desinstalar un programa, No me deja, Por be de todo pero nada, Permisos, No tengo permisos para borrarlo, Espera, Creo que lo está desinstalando el iobit, A ver si hay suerte, Navbar creo que ya está, He tocado la pagina de inicio, Ya tiene buena forma, Si, Toda la pagina, Es muy básica, Pero tiene muy buena pinta, Si, Le puse dos cosas de jquery que encontré, Por internet, No va, Se ha petado hasta iobit, ......, Libro acabado, 😆, Hablo del de la chica del tren, Ahora le estoy metiendo caña al nuevo, Hover?, Ni idea, Cuando esta sobre algo o la normal?, 👍, 9:30, Estaré yo, Yep, Me acabo de despertar, Tu?, Si, Voy a parar ya por hoy, Estoy dando palos de ciego, 😆, Esta bien, 😂, Mañana bo se si enseñarle lo que tenemos o no, Para preguntarle, Prefiero el descanso la verdadera, 😂, Uhm, Ahora pensándolo hacer una página estática es bastante fácil la verdad, Ya, Una dinámica es una locura, Mira esta, http://www.devoncrawford.io/, 10/10, Yep, Este arco de sao no se hacia donde va, Cap 9 y no tengo ni puta idea de lo que trata esto, No me esta llamando mucho la verdad, Todavia falta paraclo del harem, Para lo*, El corrector, ..., Yo como y me le daré, Metemos un display flex y ya está, En cada una, 😂, Voy a ver la grabación de inglés, Y me conecto, 30, Lo del audio lo solucionamos el miércoles?, Discord?, Quiero solucionar eso de la hamburguesa, 5 min estoy, CV a, Metete, Hacemos una galería en vez de faq?, Con grid, ?, Un html nuevo con 6 o 7 imagenes, Voy a probarlo mañana, A ver qué tal, Css de que pagina?, Por que meto demasiada mierda, Me paso, Ya, 😆, Va, Hago puta magia con estas manos, Joder, Sacaste todos, Espera, Me conecto y le damos, Multimedia, Mi form ya lo he acabado, Muy simple, Pero tiene css y grid, Se ve bastante bien la verdaf, Verdad, Multimedia, Xd, he jugado una partida al lol, y se me han quitado las ganas de jugar, 18:30??, Para hacer los retoques finales?, Me falta la barra, Tengo pensado en poner una frase en japones por encima del vídeo, Creo que podría quedar bastante bien, Y mas en responsive, 😆, Lo importante es que funciona, Utilizando las dos, Dos pájaros de un tiro, Lo de grid es en responsive si mal no recuerdo, Tu no toques nada por si acaso, Jajajajajajajaaja, Si quiero que queden bien, Es lo que hay, Haz lo que quieras, Con tal de que no afecte como ha quedado al final, 👍👍, Ready?, Multimedia, He vuelto a petarlo, Lo bueno es que sé como solucionarlo, Se puede utilizar el terminal estando la pantalla en negro, Yep, Como borre un archivo del sistema operativo sin querer, Van a ser risas, La putada es que no se puede hacer scroll, No se si podrá de algún modo, Sabes como se borraba un archivo?, El comando, Hehehehhe hago magia, Lo de tener el control de todo sin ni siquiera estar dentro sistema, Mola, Cristian, Me tienes que ayudar en navidades con esto de bases de datos, Ya somos dos, Estoy mas perdido, Tienes los dos últimos?, 😆, 👍👍, Van a ser unas Navidades interesantes, Lel, Interesante, El Monster hunter va estar gratis unos dias, A partir de mañana, Por si lo querías probar, ?, Todavía no, Iba a empezar mañana, Por?, Input pies y pulgadas, Salida metros, Cm, Creo, Espera, Pulgadas?, Que coño es eso, Los pies son la unidad de medida en america del norte, Pero pulgadas, No me suena, Uhm, Ok, Creo, 😆, 👍👍, Thx, Los tres de pan de pipas son mios, Jajajajajajaj, Se lo iba a mandar a mi hermana, 😂😂😂😂😂😂😂, 😆😆, ?, Si, Tienes que proceder a la descargación de dicho programa, Has procedido?, 👍👍, Hablas de inglés?, Yep, Una cosa, Si la vas a ver apúntame el nombre del libro, Y cuenta el num. de okeys que dice, No me acuerdo de como se llamaba para pillarlo mañana, No me acuerdo exactamente, Subnautica ya está free, Yo no, 😆, Creo, Yo en un rato lo pillo, Una cosa, La cuanta admin de windows, Que ventajas tiene con respecto a la normal tuya?, Me solucionara lo de avast?, Yo creo que no, Según esto parece ser que no, Uhm, Nope, No me deja, Lo de no tener permisos en mi ordenador, Mola, xd, Espero que les salga bien la jugada a los de epic games, La idea es demasiado buena para ser verdad, Si sacan juegos del mismo calibre  que subnautica cada dos semanas, Triunfan, Seguramente lo consigan, Teniendo en cuenta lo que hicieron con fortnite, Lo dudo, Pero, Quien sabe, Escuchan a los consumidores, Yep, El test de mañana sabes como va a ser??, Uhm, Dijo 30 preguntas, Si mal no recuerdo, 😆, Nadie irá el viernes?, No entiendo nada, No se si esto me va a afectar a mí, Espero que no, En el primer ejercicio de java, Que hay que pedir en input?, Pies y pulgadas, ?, O solo pies, Uhm, Okey, Pero en el enunciado pone las dos cosas, Multimedia, Christian, Me puedes pasar el programa de la pizza, Gracias cHristian, Perfecto, Bienvenido al club, 👍👍, Has visto el evento nuevo del jiego, Lo sacaran mañana, Ni idea, Pero no estan mal, Ni me he fijado, A la mitad ni los conozco, 😆, Me gusta, Cristian, Me puedes ayudar a pasar mi programa a metodos?, Creo que se como, Mañana te comento, Multimedia, Uhm, Sabes como poner esto mas resumido, ?, Multimedia, Si, Eso es lo de menos, Lo que voy a hacer yo, Es que el usuario meta tan solo pies, Y en la parte de pulgadas, Paso los pies a pulgadas, La cosa es que funciona, Ya, La mayoría lo habrá echo asi, Para cambiar, Entones por que ha puesto fidel lo de  12 pulgadas son un pie?, Yo creo que si, Con un input puedes sacar todo, Son numero, Creo que es lo último, Por que es muy simple, Sobre la pregunta, 😅, Estq, Sabes como ponerla más simple?, Fidel podra elegir entre x opciones para que vea lo que  quiera de las distintas conversiones que hay, La cosa es que si pongo algo que no sea un int, Se peta el scanner, Lo cual es normal, Que debo de poner en la condición para solucionarlo, ?, Es lo que estoy viendo ahora, Pense en un try catch, Pero no se, En el catch meto un sout y ya, Espero que funcione, Solucionado, Confirmamos que try catch es la clave, Enfocándolo como un videojuego, ....., 😆, Somos 3 en clase, Buena, Estoy sentado al lado de un cura, Si, xD, Sigo flipando con el diseño de la página de gallery, La mejor con diferencia, Conseguiste solucionar subnautica ayer?, Okey, Si veis que va, No, Sigues teniendo el documento .txt de mta??, Me vendría bien para repasar, Me faltan 3, Los haré luego, Espera, Has copiado 200 preguntas??, 😆, Joder, Ya, Lo que no se es si al hacer los dos intentos se pueden ver las respuestas después, ...., Le mandaré un correo si eso a pilar, A ver si puede solucionarlo, 👍👍, Cristian, Sabes la fecha de los exámenes que tenemos a la vuelta?, 👍👍, Lo mas seguro, Mierda, ...., Joder, No sé si la has visto, kimi no suizou wo tabetai, Si quieres llorar fuertemente, Preparate, Diría que es mejor que shigatsu wa kiminouso, Demasiado puto buena, Llevaba como un mes sin ver nada, Y ayer hablando con un colega me la recomendó, Y joder, Has oído algo de hytale???, Dicen que va a ser el proximo minecraft, Le tengo unas ganas, Si, Creo que si, Si, Esta capada aquí en Europa, Yo de normal no baja de los 56, El ping, En Asia suelen tener 12, Si, 😆😆, Panel de contro, Desinstalar programas, League of legends, En el propio cliente, No, Si, Yep, Esta muy optimizado, Antes pesaba 20 gb, Hace unos 4 años, Ni idea, Tendré que informarme, Pero han tocado cosas, Creo que antes te tenias que descargar todos los parches de la temporada, Ahora tan solo la última, El último*, Si, Es el juego mas jugado, 😆, Tienen medios para hacerlo, "wc" es lo que se utiliza para contar elementos,nó?, 👍, xd, Te la has jugado con esa página, Bienvenido al nuevo mundo, cazador, 60, Con alguna cosa bajada, Lo de calidad no hace falta que la bajes, Toca las opciones que están abajo, Voy a conectarme y te paso mis settings, Multimedia, Multimedia, Multimedia, Para mí sin bordes, Antes había unos bordes negros en pantalla completa, Un poco molestos, No se si lo han solucionado, xd, Contra los monstruos tochos, Seguramente te baje a 20, Nah, 60 fijos, Contra algunos aveces me baja 55, Algunos tienen demasiados efectos en los ataques, Por lo que es normal que bajen un poco, Mando o teclado?, Tienes que probar mi arma, Glaive, Con el teclado, No se cómo cojenes logre dominarla, Es bastante jodida, Y mas con teclado, 😆, Hehehe, Dos cosas, Con la glaive puedes resetear los tres saltos cuando te estas pegando, Puedes estar tranquilamente 20 segundos en el aire, Las duales no rentan tanto, Por lo qhe he visto, La que utilizo es la que tiene más movilidad, Pero claro, Es bastante jodida de perfeccionar, Ya que puedes esquivar todo, Discord?, Tengo media hora libre, Destiny y activition se han separado, Multimedia, Creo que bungie, En estos momentos, Tiene todos los derechos de destiny, Heheheheheehhehe, Adios dlcs de 60 euros, Voy a aprender una pieza de death note en el paino, La mítica canción, La actividad evaluable es la del ciclista?, Okey, 👍👍, 👍, Multimedia, Lol, Me acabo de enterar de la sacada de nvidia con lo de freesync, Espero que funcione bien, Por lo que leído en estos momentos afecta a la mayoría con 144hz, Espero que funcione, Multimedia, Dios, Es verdad, Se me había olvidado, xd, Si, Pásame lo que has hecho cuando puedas, Fata solo el 13?, Yo algunos de estos últimos no tengo ni idea, Nope, La verdad es que no, Si, Pero me falta demasiado, Por repasar, Estoy demasiado verde, Puedo pedir justificante en hospitalet??, xd, Multimedia, xd, los tres que he jugado este ultimo año, un poco complicado la verdad, pero bien, me pillo por sorpresa con las preguntas de ltest y la practica, yo los odio, prefiero preguntas normales, pero bueno, ahora ya se como son los examenes para el siguiente, Multimedia, Xd, Al entrar a la habitación olí como a quemado y me cagué, 😆, Prefiero no jugarmela, Limpié tmb el de abajo, Yo estoy de camino, Ya, Multimedia, 3 horas de podcast muy ricas, 😆😆, Creo que tengo un problema, Multimedia, Xd, Mierda no se ve, Multimedia, Ahora si, Han caído otros dos, Oriol y matias se han pasado a online, Hemos pasado de ser 50 a 17, Si, El primer dia todos los ordenadores estaban cogidos, 😆, Si mal no recuerdo, Lo de hacknet es un desfase, Mis dieces a los desarrolladores, me puedes pasar las soluciones de los test?¿, thx, 👍👍, Multimedia, algo es algo, a mi ayer, no notaba diferencias en ultra y bajo, xd, fue bastante gracioso, no se, a mi me iba 50-60 en ultra/alto, y cuando lo cambiaba a todo a bajo los mismos fps 50, a ver que hacen, https://www.youtube.com/watch?v=3t9DpdocMuI, gozatelo, xD, Mierda, 7 en sistemas, Si, Me jodió vivo el test, ....., Minecraft sigue comiendo mucha gpu, Joder, Buscas la formula de esa serie??, n= n + nn + nnn + ......, 1= 1 + 11 + 111 + ..., 9*1= 9+ 99 + 999+ ...., 9n = (10-1)+(100-1)+(1000-1)+..., S = (10*((10^n)-1)/9)-n, Me he saltado unos pasos, Por que sino te explota la cabeza, S= ((10((10^n)-1))/81)-(n/9), Esa es la formula final, Exactamente no se que quieres hacer, Pero la fórmula de la serie es esa, Mascara??, No se exactamente, Pero esa serie tiende a infinito, Me he perdido, De ip a máscara de red, Aaaa, Yo allí me he perdido, La serie entonces pa qhe la quieres?, Que*, Una ip es finita, Si vas a aplicar esa serie, La tienes que capar, Que si no peta, Ando muy perdido en esto, No se si soy subnormal o algo, Pero lo de pasar la ip, Nada, Mañana explícamelo, Estoy medio muerto ahora, La serie esta es un tanto complicada ahora que lo pienso, En número en si, Si fuese el número de veces sería finita, Una cosa, No hagas el programa en torno a esta serie, Llevo meses sin tocar matemáticas a fondo, Okey, Tu dime, Hablas de los bytes, 1111.1111.1111.0000, ?, Multimedia, Multimedia, 👍, 👍, 👍, Que te pide el ejemplo, ?, Ejercicio*, Vale, Hasta donde has llegado?, Este lo quiero hacer por mi cuenta, Tiene buena pinta, Como sacabas el 22, xD, ?, Era una resta, Pero no se de que, Cristian, Voy a ser sincero, No tengo ni idea, Pero tiene buena pinta, Mañana seguramente no atienda, Quiero sacarlo solo, xd, Meh, No me ha convencido el juego, 😕, La verdad es que no, Set/get programacion, Configurar phpmyadmin sistemas, No sabría que decirte, En sistemas si que pedaleo un poco, Apunté bastante cositas, https://youtu.be/23c5SSkgj4Y, Youtube, Tiene muchas joyas escondida, Supuestamente es un meme, Yo me enteré de eso con este video, 25 millones de jugadores totales en apex legends, La primera semana, Si se mantiene un buen numero el primer mes, Salen ganando, No se, Ni me he molestado en informarme, 😆, xd, Monitor???, xd, Uhm vale, Antes estaba jugando con un dlc activado que ponía algunos npcs demasiado fuertes, xd, https://youtu.be/6ktDxzN8Y2U, Qué opinas??, Esta pelea es del último dlc, Es una versión tocha del  bos normal del principio, Esta pelea es de las mejores del juego, La del principio, No sabría que decirte, Todavía tengo pendientes los dos últimos, Que va, El normal si, Esta locura todavía no, Multimedia, Ha dado fecha de examen?, 👍, ¿????????, Suerte con los números imaginarios, 😆, Tendría que repasarlo, Llevo años sin utilizalos, No me deja abrirlo, Cuando llegue a casa lo miro, 😆😆, Que grandes, Multimedia, Estas ya en sants?, Yo en el túnel, Todavía, Cristian, Me puedes pasar cuando puedas el método suma de imaginarios, El que hizo Fidel en la pizarra, Tenemos que implementar también los métodos de multiplicar y dividir?, No se si lo confirmó o no, Okey, El examen de programación es el 8, Lo acaba de confirmar, Programación, Interfaces, Ejercicios a mano, Si, Multimedia, Antes lo probé, Pero no me funcionó, Sin el this me dejó, No se, 😆, Me la lío el canbrón, Cabron*, La puta dislexia, Multimedia, Xd, Si, ???????, Seguro, ???, En las dos?, Okey, Una cosa, Multimedia, No se exactamente que documento tengo que entregar, De lo de titulación, Me piden el resguardo de los cobros?, Vale, Me lo han pedido que lo entregara mañana, Sin previo aviso, 😆, Me cagado vivo, A mi cada mes me llega a mi correo un mensaje con un PDF de IFP, Que dice que les han recibido el dinero, No se si sera eso, Si, Mañana hablare con ellos, Multimedia, Casi me da un micro infarto con lo último, Nada, La verdad es que no se, Estoy cagado, 😆, En que piso esta secretaría??, 3?, Okey, 👍👍, Cristian, Me pieces explicar lo dead que un metodo  sea static, Puedes *, Hize el programa sin poner ningun método/variable en static, Uhm, Entonces, Puedo pasar tanto las variables como los metodos a static, Espera, Paso todos mis metodos a static, Y dentro de cada uno tengo que poner de que tipo es cada variable, ?, Multimedia, Lo hize, Joder, Najdhsudshdgw, Si, 😆, Algún consejo?, Se lo preguntaré a Fidel el martes, Ya, Voy a hacer el último apartado, Seguramente lo deje así, Aunque este medio mal, Si paso todo(variables y los métodos que pide) a static que pasaría, ?, 😆😆😆, Meh, Queda mas estético la main, Sin los print, Todo muy limpio, Puto static, Bqhshwhydgagsvshsvwgwuwhe, Tienes por allí la formula del último apartado del 4?, La de punto flotante, La copié mal, Me faltan un par de paréntesis, Thx, tienes por allí el archivo javascript de pilar?¿, xD, thx, espera, te pedi el .zip que subió ella a su pagina, xD, no los queria resueltso, 😆, Para mandar??, Perfecto, Mañana me lo comentas, Estoy echo mierda, 😆, Salí a las 6 y media, Llegué a las 10 y cuerto, De la noche, Es como si me hubieran dado una paliza, Van a sacar la saga halo para steam, En*, En su momento, Casi me compro la xbox para jugarlo, El reach pego un bombazo, Que te cagas, Lo que no se es si van a hacer un remaster, O van a ser los legacy, Multimedia, xd, https://youtu.be/O6rN540rzjY, Es normal que tenga tanto hype??, Multimedia, Eeeheheheheh, Multimedia, En casa, Xd, Mis dieces, Esta a 52 euros, Joder, No se como puedes jugarlo pirata, Para mi es imposible, Me siento mal y todo, 😆, Yo cuando acabe los que tenga pendientes, Me lo pillo, 🤪, Heheheeh, Yo probe ayer xcom 2, Que lo han puesto gratis este din de semana, 😆, Tema de fps?, Para mí todo esto es algo nuevo, No me he pasado nada parecido, Espero gozarmelo, En el método resta, Reutilizaste el método de fidel?, Misma estructura digo, Ya, Por eso lo pregunto, 😆, Nope, Sigo sin entender por que ha utilizado arrays, En un método simple, Double..., Exactamente que significa, ?, La primera vez que lo veo, La primera vez que lo veo, En un metodo, Vale, El problema no tenia con el método, No lo*, Eran los putos botones, Multimedia, Es feo como un pie, Pero funciona, Han aprobado el artículo 13, Rip memes, Yep, Por que he leído por Twitter, 348 a favor, 274 en contra, Mañana publican la lista con los nombres de los 348, 😁, 😆, Tio, Quiero el puto sekiro, 👍👍, Hay algo para mañana?, Promised neverland acabada, Plantea una idea interesante, Quiero ver como sigue el siguiente arco, Nope, Prefiero esperar, Pilar si que va han dicho, 😆, Has visto la foto del agujero negro?, Parece ser que no, Jajajajajajaj, Ya te comentaré mañana, Por que he visto esas joyas, 😆😆😆, Echas un Borderlands luego??, Me aburro, Que va, Llevo como una semana sin meterme, 😆, Multimedia, Lol, Ya me enteré de eso, Buen gesto por parte de ubisoft, Cristian, Tienes a mano tu método?, Para el que suma, Combinar(), Si, Tengo lo último mal, Pero lo demás bien, Si, NO, NO, Mi hermano pequeño se las vio todas el cabron, Hheheheheheh, Not even close, 👍, 😁, Si, No voy a estar hoy, 😕, Yo bien mas o menos, Tan solo me estoy adaptando a un cambio, El lunes seguramente este al 100%, Mas tarde, Estoy con el ayuno intermitente, xD, Sobre las 7:30, Mas o menos, Si, Lo de lenguaje de marcas es para mañana?, No se, Cristian, Sabes algo de las fechas de entre de los dos de programación y el de sistemas??, No, Por eso te pregunto, Igual comentó algo el último día, Okey, Y de programación?, Los dos para el 22?, Okey, El martes preguntamos, Que tenemos clase, Meh, Sigo medio muerto, Hablas de prog?, Yep, Acabo de ver tu mensaje, Sorry, Que yo recuerde no quitó nada, Dijo algo, Pero no me acuerdo exactamente, Repasa todo por si acaso, Ya conoces a juan, Aaa, Solo hacia falta hacer la base de datos, No habia que tocar nada de programación, Bien, Mañana pasare todo a limpio, La fiebre me ralentizado, Bastante, Ha*, XD, Tienes a mano el metodo has utilizado para leer la parte de los productos?, Descripción de los productos, Fichero, Falte el último dia, Por eso te pregunto, De ficheros no he encontrado nada en github, Solo hay la de base de datos, Yep, Gracias, Nice, Yo estoy dias estoy hasta arriba de cosas, Lo siento, Lo comento antes fidel, Ha dejado hasta el viernes, Para el entregable, Creo que hah que entregarlo hoy, Pero las versiones las puedes actualizar, Por github, El vera la última, La idea es interesante, La verdad, Tiene sentido, xD, La hoja de la matrícula cuando hay que entregarla??, 👍, 200, Si mal no recuerdo, No se, Multimedia, Nada, Olvidalo, Todo aprobado, Falta evaluación continua de fidel y ya, Eso es lo que me falta por confirmar, Jajajajajjajaa, 5, Me esperaba más, 7 o algo, Pero no se, Si, Daba lo que pedía, Meh, No pasa nada, 😕, Lo mas seguro, 3 horas de tren para media hora de clase, Muy ameno la verdad, Bwjdhdhsydvshsvdhfhdhd, 🤪, Ya, Es lo que hay, Dimelo a mí, Que casi muero, Con la de cosas, Es este miércoles, ?, No se, Yo toque cosas, La mia esta muy bien, Te la paso ahora si quieres, ☹, Yo acabo de llegar, Uhm, 👍, Lo puedo pillar yo, Ya me lo devolverás el año que viene, Con el pan de pipas, Asi, Me pille un teclado mecánico, Por unos 59, 50, Me llega mañana, Switches blue, Los que hacen ruido, Puro orgasmo para los oidos, Ya, xd, El mio lo monte por 800, De 0, Disco duro y disipador ya tienes, Ventiladores tmb, Yo estuve 5 años ahorrando para esta cosa, Que tira tan solo indies, 🤣, Multimedia, xd, Antes lo tenia encima del escritorio, Molaba, Multimedia, Xd, Prisa no tengo, Para lo que lo utilizo, Voy demasiado sobrado, El salto lo daría por ciberpunk, Yep, 👍, Multimedia, Multimedia, Multimedia, 👍, Hoy no vino fidel, Perfecto, No aviso ni nada, Es más mando el mensaje por el campus cuando nos fuimos todos, 10, La mitad fuimos para preguntar, Multimedia, Ya, xD, Heheheheh, 👍👍, Thx, Pfff, En la uf5 han caido mas de la mitad de la clase, 😮, https://youtu.be/VGksHFs04Rc, Tremenda paja solo por la banda sonora, No vas a parar con los memes, xD, No me gusta la fecha, Si, Caerá en muy mala semana, Al menos pa nosotros, Me hubiese gustado final de ese año, Pero bueno, Lo de keanu reeves, Me flipo, Uhm, Okay, Eso me flipo, Multimedia, Multimedia, Fue una sacada, Muy basta, El juego de 12 min, Lo viste??, Pff, Bucle infinito, Me pone muy cachondo, While(true){}, Ender, No se que, Lo de que este grr martin, Me pone muy cachondo, Ese tio escribe mas de lo que habla, El nuevo ori?, Asi, Me pille el battlepass, Por un euro, Primer mes, Hellblade, Metro, State of decay, Primer ori, Y mas juegos, Solo vi esos por encima, Yo le voy a meter al mhw, Han metido nuevas cosas, Witcher + nuevo monstruo tocho, Nope, Llevan metiendo cosas gratis, Desde que salió, Uhm, Digamos, Que en juego base estan los dragones ancianos, Que son lo maximo, Despues de eso cada uno, Es curtido, Luego, Hipercurrido, Y el final es archicurtido, Si, Nergigante archicurtido, Estoy sants, Voy a desayunar aquí, Y voy, Espérame, Subo en 1 min, Estoy abajo, Estoy, Donde los libros, Como no apruebes el examen mañana, Me voy a cabrear, Estaba en Valencia, Tenia cita con la dentista a las 10, Lo de avisar con suficiente antelación se lo han pasado por...., Me enteré, De la recu, Cuando esta en tren para valencia, Estaba*, Meh, Un poco sad por el título este pero no pasa nada, Lo se, Lo voy a volver a instalar, En unos dias, Para prepararme, Estas libre ahora?, Me aburro, Borderlands?, No tengo ni idea, 😆, Voy por el principio, O quieres monster?, Me da igual, Han dado fecha para lo de las notas?, 👍, Ir a por ellas, xD, Me llego un email, Hace poco, Han puesto las materias?, Pffff, Llevo así todo el verano, Metiendome cada 5 dias, Para ver si hay algo nuevo, Yep, Quiero ver el tema, Del horario, Cuando empezemos, Y las distintas opciones que tenemos, Con lo de las empresas, Una amiga me ha dicho, Que las horas allí, Cuentan el cv, Y lo de Cambridge?, xD, Yep, Entramos una hora tarde, Ese dia, Creo, Confirmaran todo cuando empezemos, +, Somos pocos este año, Bueno, Algún repetidor habrá, De los de 2 año, Empieza en septiembre, Creo, El papel, Lo hemos dado, Que es lo más importante, Puedes pasar algun dia de estos?, Y preguntar, Yo no voy hasta el 19, El papel lo di, 🤷🏻‍♂, A ver lo que dicen, xD, Ifp, ....., Ya, Yo quiero el título, Y ya, También, Al menos con esto puedo trabajar, Y hacer la carrera, Es verdad, Najdsjdhsjssjasj, Yep, Me espera un año, Ajetreado, Ya veremos, Me han mandado por el campus, El horario de damn, De 1 año, 🤦🏻‍♂, Multimedia, xD, Que mierda, Es esto, Si, Me acabo de meter ahora, Y vi esto, Multimedia, Te han mandado otra cosa a tí?, No entiendo nada, Lo de bienvenida ya lo sé, Te preguntaba por este último mensaje que han mandado, Me he metido para ver si han actualizado algo, Y veo este mini horario, 🤦🏻‍♂, Me descojonado, Jajajajajajaja, xD, Mañana a las 10 no?, Perfect, Estoy en el tren ahora, Sobre las 9:10 estaré en la estación, Te espero allí?, Jajajajajja, Que grande, Okay!!, Te veo allí entonces, Buena cristian, 10/10, xD, Yep, Estoy abajo, Saliendo del tren, Donde, Estás?, Yo no he salido de arriba, Estoy en el centro, Okay, Voy pa allá, Pillame mi sitio, Que no quiero que me lo quitrn, No, Quiero ese en específico, Y mío no esta libre, El de ayer digo, El*, Pues nada, Tendre que levantarme una hora antes, Para pillar ese sitio, Pillo justificantr, O no?, Ya estoy, Rn hospitalet, No se, Tendría que ver en mis documentos, No te puedo confirmar, Que mierda, El pet es de la eso Cristian, Ll que veas, Lo*, Mañana por la mañana?, Si, Pero no se, Nah, Quería desconectar hoy la verdad, Ni te voy a mentir, No*, Vas a repasar luego?, OHHHHHHHH, Okay, En un rato estoy, Np, Estaba con lo del CV, Lo has formateado?, Rip, Nah np, Era tan solo para comentarte, Lo de no haber de cosas en específico del proyecto, Lo que no quiero es que me roben la idea, Tengo cosas en mente, De cómo podría quedar todo al final, Luego te llamo entre esas horas, Cristian estas?, Yikes, Curisstiaan, Okay, Yep, Llegue a tiempo, No se como, Creo que hubo retraso en el tren, Tu que crees, Que me hagas esa pregunta, Dice mucho, 🤦🏻‍♂, Estoy yendo, Estoy ya rn hospitalet, No se puede copiar no?, Hay que tocar si o si?, Control + f, No se, Ni idea, Tendré que ver, Es lo que hay, xD, Cristian, Me podrías comentar luego lo que habéis hecho hoy?, Por favor, Uhm, Ahora no puedo hablar, Estoy en el tren, Y cada dos por tes pierdo conexión, Si, Ha dicho algo, Sobre el del primer dia?, Okay, Luego te llamo, Gracias, Saaal, Fuerraaa, Multimedia, }]